[
    {
        "title": "에 대해서",
        "explainations": "This grammar pattern is used with a noun to show a performance by possessing a fact related to the noun. It is often used as ‘에 대해서’ or  ‘에 대한’.\n\nမြန်မာစကားတွင် “ပတ်သက်ပြီးတော့” ဟု အဓိပ္ပာယ်ရကာ ရှေ့တွင် Noun နှင့်တွဲသုံးရသည်။\n\n명사 뒤에 붙여서 앞 명사와 관련되어 있는 의지를 보여줄 때 쓴다.",
        "examples": "저는 이번 회의에 올해 이익에 대해서 발표하고자 합니다.\nI want to give you all a presentation concerned with this year profit.\nကျွန်တော် ဒီနေ့အစည်းအဝေးမှာ ဒီနှစ်အမြတ်နဲ့ပတ်သက်ပြီး ပြောပြချင်ပါတယ်။\n\n게임에 대한 집착이 큽니다.\nI completely obsessed with games.\nဂိမ်းနဲ့ပတ်သက်ပြီး ‌စွဲလန်းမှုက ကြီးတယ်။\n\n저는 환경 문제에 대해 꼭 말씀드리고 싶습니다.\nI definitely want to tell you all concerned with environmental problems.\nကျွန်တော် ပတ်ဝန်းကျင် ဆိုင်ရာ ပြဿနာနဲ့ပတ်သက်ပြီး သေချာပေါက် ပြောပြချင်ပါတယ်။"
    },
    {
        "title": "을지/ㄹ 지 모르겠다",
        "explainations": "It is used together with a verb to express concern about the situation which is ambiguous.\n\nဤအသုံးအနှုန်းသည် မသေချာ မရေရာသော အခြေအနေကြောင့် ဖြစ်ပေါ်လာသော စိုးရိမ်ခြင်းကို ဖော်ပြရာတွင် သုံးသည်။\n\n동사 뒤에 붙여 쓰고 어떤 애매한 상황 때문에 벌어진 걱정을 표현할 때 쓴다'",
        "examples": "이 영화가 너무 유명해서 표가 남을지 모르겠네.\nI am not sure if we can get the tickets since the movie is really popular now.\nဒီရုပ်ရှင်က အရမ်းနာမည်ကြီးလို့ လက်မှတ်ရပါ့မလားတောင် မသိပါဘူးဟယ်။\n\n 밥을 차려 놓았는데 아빠가 챙겨 먹을지 모르겠다.\nAlthough I prepared the food, I don’t know if my father will eat well.\nအစားအသောက်တွေ ပြင်ထားခဲ့ပေမယ့် အဖေ သေချာ စားပါ့မလားမသိဘူး။\n\n비가 많이 와서 제시간에 도착할 수 있을지 모르겠다. \nIt is raining a lot therefore I don’t know if I can get there in right time.\nမိုးတွေအများကြီး ရွာနေလို့ အချိန်မီ ရောက်ပါ့မလားတောင်မသိဘူး။"
    },
    {
        "title": "에 비해서",
        "explainations": "It is used after noun to show comparison.\n\nဤအသုံးအနှုန်းကို ရှေ့တွင် Noun နှင့် တွဲသုံးရပြီး နှိုင်းယှဥ်လိုသောအခါတွင် အသုံးပြုသည်။ မြန်မာစကားတွင် 'စာရင် ၊ နဲ့ ယှဥ်ရင်' ဟု အဓိပ္ပာယ်ရသည်။\n\n명사 뒤에 붙어서 비교함을 보여 주고 싶을때 쓴다.",
        "examples": " 지난달에 비해서는 이익이 좀 떨어진 편이다.\nCompared to the last month, the profit is a little bit lower.\nအရင်လကထက်စာရင် အမြတ်က နည်းသွားတယ်လို့ ပြောရမယ်။\n\n이 교실은 학생수에 비해서 조금 작은 것 같다.\nThis classroom is a little bit small compared to the amount of students.\nဒီစာသင်ခန်းက ကျောင်းသားအရေအတွက်နဲ့ ယှ ်ဥရင် သေးတယ်လို့ ပြောရမယ်။\n\n우리 회사는 다른 IT 회사들에 비해 월급이 많은 편이다.\nOur company gives a bigger amount of salary compared to other IT companies.\nငါတို့ ကုမ္ပဏီက တခြားအိုင်တီကုမ္ပဏီတွေထက် လစာများတယ်ပြောရမယ်။"
    },
    {
        "title": "는 동안",
        "explainations": "Used with an action verb and it shows that the performance in the second clause is done while the performance in the first clause is occurred. And also used with a noun to indicate duration.\n\nဤအသုံးအနှုန်းသည် Action verb နှင့် အသုံးပြုလျှင် တစ်စုံတစ်ခုဖြစ်နေသောအချိန်အတွင်း နောက်တစ်ခုပါ ထပ်ဖြစ်သည့်အခါ အသုံးပြုပြီး Noun နှင့်တွဲသုံးလျှင် ကာလအတောအတွင်းကို ရည်ညွှန်းရာတွင် အသုံးပြုသည်။\n\n동사 뒤에 붙어서 어떤 일이 벌어지고 있는 동안 다음 사건도 발생하는 모습을 나타내고 명사 뒤에 붙어서 쓰면 기간을 가리킬 때 한다.",
        "examples": "선생님이 가르치고 있는 동안 미나가 친구들하고 떠들고 있었다.\nMina made a noise with her friends while the teacher was teaching.\nဆရာမ စာသင်နေချိန် မီနာကတော့ သူငယ်ချင်းတွေနဲ့ စကားပြောနေခဲ့တယ်။\n\n집에 쉬고 있는 동안 책들 많이 읽을 거예요.\nI am going to read a lot of books while I take rest.\nအိမ်မှာနားနေချိန်အတောအတွင်း စာအုပ်တွေအများကြီး ဖတ်မှာပါ။\n\n산책하고 있는 동안 갑자기 비 오기 시작했다.\nAll of a sudden, it started raining while I was walking.\nလမ်းလျှောက်နေစဥ်ရုတ်တရက် မိုးရွာချလာတယ်။"
    },
    {
        "title": "거나",
        "explainations": "It is used together with a verb to show choices. A verb which comes before and after 거나 shows your selection among two choices.\n\nဤအသုံးအနှုန်းကို ရွေးချယ်မှုကို ပြသရာတွင် အသုံးပြုသည်။ 거나 ၏ ရှေ့နှင့်‌နောက်တွင် verb လိုက်ပြီး မြန်မာလိုဆိုလျှင် “ဖြစ်ဖြစ်” ဟု အဓိပ္ပာယ်ရသည်။\n\n동사 뒤에 붙어서 어느 것을 선택해도 차이가 없듯 둘 이상의 일을 나열할 때 쓴다.",
        "examples": "분홍색을 고르거나 초록색을 고르거나 둘 다 너와 잘 어울려.\nWhether pink or green one, you are okay with these two colors.\nပန်းရောင်ရွေးရွေး အစိမ်းရောင်ရွေးရွေး မင်းနဲ့ နှစ်ခုလုံးလိုက်ပါတယ်။\n\n주말에 제주도에 가거나 낚시하러 갈까?\nWhere will you want to go this weekend?  To Jejudo or fishing?\nဒီပိတ်ရက်မှာ ဂျယ်ဂျူဒိုသွားမလား? ငါးဖမ်းဖို့ သွားမလား?\n\n요즘은 이메일을 하거나 전화를 합니다.\nI email or call nowadays\nဒီတလောတော့ အီးမေးလ်ပို့တာဖြစ်ဖြစ် ဖုန်းခေါ်တာဖြစ်ဖြစ် လုပ်ပါတယ်။"
    },
    {
        "title": "습니다만 /ㅂ 니다만",
        "explainations": "This grammar can be used with a verb to show the opposite meaning of the first and second clause. It is more formal than a connective ending “지만”.\nဤအသုံးအနှုန်းသည် စာကြောင်းတစ်ခုနှင့်တစ်ခုကို ဆက်ပေးရာတွင် သုံးပြီး ထို နှစ်ခု၏ ဆန့်ကျင်နေမှုကို ပြသသည်။ 지만 ထက် ပို၍ formal ကျသည်။\n동사와 붙여 쓰고 첫 번째 절과 두 번째 절의 반대를 표현할 때 쓴다.",
        "examples": "만난 적 있습니다만 이름은 기억 못하네요.\nEven though we have met before, I can’t remember your name.\nအရင်က တွေ့ဖူးကြပေမယ့် ခင်ဗျားနာမည်တော့ မမှတ်မိဘူးရယ်ဗျ။\n\n죄송합니다만 다시 한 번 만 말해 줄래요?\nI am sorry but can you please say it again?\nအားနာပေမယ့် နောက်တစ်ခေါက်လောက်ပဲ ထပ်ပြောပေးပါလား။\n\n메일을 보냈습니다만 답장이 안 왔네.\nEven though I sent an email but I didn’t get a reply until now.\nအီးမေးလ် ပို့လိုက်ပေမယ့် ခုထိ ပြန်စာ မလာဘူး။"
    },
    {
        "title": "아/어/여 있다",
        "explainations": "This form is used together with an action verb and shows continuous performance.\n\nAction verb နှင့် အတူ တွဲသုံးရပြီး အဆက်မပြတ် ဖြစ်နေမှုကို ဖော်ပြသည်။\n\n작용 동사와 붙여 쓰고 연속 성능을 표현할 때 쓴다.",
        "examples": "창문이 열려 있다.\nThe window is open.\nပြတင်းပေါက်က ဖွင့်လျက်ရှိနေတယ်။\n사무실 앞에 한 시간 전에 만났던 그 사람이 아직도 서 있어요.\nHe is standing still who I met in front of the office an hour ago.\n လွန်ခဲ့တဲ့တစ်နာရီက တွေ့ခဲ့တဲ့ ရုံးခန်းရှေ့က လူက ခုထိလည်း ရပ်နေတုန်းပဲ။\n\n그 집에 아무도 없으면서 대문이 열려 있어요.\nThere is no one in this house but the front gate is still open.\nအဲ့ဒီအိမ်မှာ ဘယ်သူမှလည်းမရှိပေမယ့် တံခါးမကြီးက ပွင့်လျက်သားကြီးရှိတယ်။"
    },
    {
        "title": "지 않으면 안 되다",
        "explainations": "This pattern can be used together with a verb to indicate necessity. The double negative expresses a strong positive meaning.\n\nverb နှင့် တွဲသုံးရပြီး ဒီအရာတစ်ခုကို မလုပ်မဖြစ်သော အချိန်တွင် သုံးနှုန်းပါသည်။\n\n동사 뒤에 붙어서 쓰고 이 일을 해내지 않으면 안 될 때 쓴다.",
        "examples": "담배를 끊지 않으면 안 됩니다.\nYou have to quit smoking.\nဆေးလိပ်ဖြတ်ကို ဖြတ်ရပါမယ်။\n\n본인이 제대로 결정을 내지 않으면 안 돼요.\nThe person himself must make a decision.\n의대에 가고 싶다면 공부를 열심히 하지 않으면 안 됩니다.\nYou have to study hard if you want to enter the medical university.\nဆေးတက္ကသိုလ် ဝင်ခွင့်ရချင်ရင် စာမကြိုးစားလို့ မဖြစ်ဘူး။"
    },
    {
        "title": "을래요/ㄹ 래요?",
        "explainations": "It is used with an action verb to ask what the listener wants to do, often by expressing the speaker's suggestion.\n\nAction verb နှင့် တွဲသုံးရပြီး နားထောင်သူ ဘာလုပ်ချင်လဲဆိုသည်ကို မေးရာတွင် အသုံးပြုရသည်။ ပြောသူ၏ အကြုံပြုချက်သဘောမျိုးလည်းပါဝင်သည်။\n\n동작동사에 붙여 사용하여 듣는 사람이 무엇을 하고 싶은지 물어볼 때 사용하여, 가끔은 말하는 사람의 추천을 표현하는 의지도 나타냅니다.",
        "examples": " 뭘 드실래요?\nWhat would you like to drink?\nဘာသောက်ချင်ပါသလဲ?\n\n커피 한 장 하실래요?\nWould you like to drink a cup of coffee?\nကော်ဖီတစ်ခွက်လောက် သောက်မလား?\n\n이번 주말에 할 일이 없으면 영화 같이 볼래요?\n Would you like to watch a movie with me if you are free this weekend?\nဒီတစ်ပတ် အားလပ်ရက်မှာ မင်းအားရင် ငါနဲ့တူတူ ရုပ်ရှင်ကြည့်မလား?\n\n간접인용 (-자고 하다, -이라고/라고 하다, -는다고/ㄴ다고 하다, -다고 하다, -냐고 하다, -으라고/라고 하다, -달라고 하다)"
    },
    {
        "title": "자고 하다",
        "explainations": "It is used with an action verb. It is an indirect speech to convey the suggestive message from the sentences of  ‘-읍시다/ㅂ 시다’ and  ‘-을까요/ㄹ까요?\n\nAction verbနှင့် တွဲပြီးအသုံးပြုရပါသည်။ ဤအသုံးအနှုန်းသည် “-ကြရအောင်၊ -ကြမလား” ဆိုသည့်အသုံးကို တစ်ဆင့်ပြောစကား (Indirect speech) အဖြစ်ပြောင်းသုံးခြင်းဖြစ်ပြီး မြန်မာစကားတွင် ဘယ်သူက ဘယ်သူ့ကို “-ကြရအောင်လို့ ပြောတယ်” ဟု အဓိပ္ပာယ်ရသည်။\n\n동작동사와 붙어 사용하다.  ‘읍시다/ㅂ 시다’ 와 ‘ 을까요/ㄹ까요? 라는 문법의 간접적인 연설로 암시적인 메시지를 전달하기 위해 사용한다.",
        "examples": " 메리 씨가 주말에 영화보러 가자고 해요.\nMary suggested that they should watch movie this weekend.\nမေရီက ဒီတစ်ပတ် ရုပ်ရှင်သွားကြည့်ရအောင်လို့ ပြောတယ်။\n\n 친구가 집에 가면 떡볶이 먹으러 가자고 해요.\nMy friend proposed that they should go to eat tteokbokki when they will go home.\nသူငယ်ချင်းက အိမ်ပြန်ရင် တော့ပိုကီ ဝင်စားကြရအောင်လို့ ပြောတယ်။\n\n 동생이 천천히 가자고 합니다.\nMy brother asked that they should walk slowly.\nညီလေးက ဖြည်းဖြည်းသွားကြရအောင်လို့ ပြောတယ်။"
    },
    {
        "title": "이라고/라고 하다",
        "explainations": "이라고/라고 하다 is the indirect speech form that re-interpret the declarative sentences of “ 이다, 입니다, 이에요, etc. It is used together with noun.\n\nဤ အသုံးအနှုန်းသည် ‘-လို့ ပြောပါတယ်’ ဟု အဓိပ္ပာယ်ရကာ Noun နှင့် တွဲ၍အသုံးပြုသည်။ သူသည်လည်း ‘ ဖြစ်သည် ၊ ဖြစ်ပါတယ်” တို့ ၏ တစ်ဆင့်စကား (Indirect speech) ပင်ဖြစ်သည်။\n\n명사 뒤에 붙여서 사용하고 ‘ 이다, 입니다, 이에요” 라는 문법의 간접적인 연설로 무언가를 선언하는 데 쓴다.",
        "examples": "연세 출신이라고 들었습니다.\nI heard that you graduated from Yonsei University.\nယောင်န်းဆယ် တက္ကသိုလ်က ဘွဲ့ရတာလို့ ကြားပါတယ်။\n\n이 노래가 요즘 제일 유명한 가수의 노래라고 합니다.\nI heard that this song is the song of the most popular singer nowadays.\nဒီသီချင်းက ခုတလော နာမည်ကြီးနေတဲ့ အဆိုတော်တစ်ယောက်ရဲ့ သီချင်းလို့ ကြားတယ်။\n\n회의가 내일이라고 들었는데 , 맞아?\nI heard that the meeting will be held tomorrow, is that right?\nမနက်ဖြန် အစည်းအဝေး ရှိတယ်လို့ ကြားတယ် အဲ့ဒါဟုတ်လား?"
    },
    {
        "title": "는다고/ㄴ 다고 하다, 다고 하다",
        "explainations": "It is the indirect speech form that passes meaning from a declarative sentence of ‘- 습니다,  -는다,  -어요,  -는군요, etc’. It is used with verb.\n\nဤအသုံးအနှုန်းသည် မြန်မာစကားတွင် “ -လို့ ပြောတယ်” ဟု အဓိပ္ပာယ်ရကာ Verb နှင့် တွဲသုံးရသည်။  “-တယ် “ ၏ တစ်ဆင့်ပြောစကား (indirect speech) ဖြစ်သည်။\n\n동사 뒤에 붙어서 쓰며 “ 습니다, 는다, 어요, etc “ 문법의 간접적인 연설로 무언가를 선언하고 싶을 때 사용한다.",
        "examples": "독일 사람들은 감자를 많이 먹는다고 합니다.\nThey said that German people eat potatoes a lot.\nဂျာမန်လူမျိုးတွေက အာလူးအရမ်းစားကြတယ်လို့ ပြောတယ်။\n\n도현 씨는 파티 같은 곳에 가는 걸 좋아하지 않는다고 해요.\nDo Hyun said he doesn’t like to go places like parties.\nဒိုဟွန်းက ပါတီလိုနေရာမျိုးတွေ သွားရတာမကြိုက်ဘူးပြောတယ်။\n\n어제 인청에 했던 행사 말이야, 엄청 대단하다고 해.\n\nI heard that the event held in Incheon was spectacular.\n\nမနေ့က အင်ချွန်းမှာ ကျင်းပခဲ့တဲ့ ပွဲက အရမ်းခမ်းနားတယ် ပြောတယ်။"
    },
    {
        "title": "냐고 하다",
        "explainations": "This is the indirect speech form to pass the message from interrogative sentence (습니까?,  -니?, -어요?). It is used together verb.\n\nVerbနှင့် တွဲ၍အသုံးပြုရပြီး မြန်မာစကားတွင် “-လားလို့ မေးတယ်” ဟုအဓိပ္ပာယ်ရသည်။ 습니까 , -니, -어요တို့၏ တစ်ဆင့်ပြောစကား (Indirect speech)ဖြစ်သည်။\n\n동사 뒤에 붙여서 쓰고 간접적인 연설로 의문의 문법이다.",
        "examples": "선생님이 학생들에게 시간이 다 되었냐고 물었다.\nThe teacher asked the students if her time was up.\nဆရာမက အချိန်ကုန်သွားပြီလားလို့ ကျောင်းသားတွေကို မေးခဲ့တယ်။\n친구들이 저에게 결혼을 언제 할 거냐고 물었다.\nMy friends asked me when I’ll get married.\nငါ့သူငယ်ချင်းတွေ ငါ့ကို ဘယ်တော့လက်ထပ်မှာလဲလို့ မေးတယ်။\n\n오빠가 여자들이 뭘 좋아하냐고 저를 이상하게 물으더라고요.\nMy brother asked me strangely what girls like?\nကောင်မလေးတွေ ဘာကြိုက်တတ်လဲလို့ ကျွန်မအစ်ကိုက ကျွန်မကို ထူးထူးဆန်းဆန်း လာမေးတယ်။"
    },
    {
        "title": "으라고/라고 하다",
        "explainations": "It is used in the end of an action verb and conveys the meaning by indirect way from imperative sentences like , “ –으십시오, - 어라, -으세요, -지 마세요”.\n\nဤ အသုံးအနှုန်းသည် Action verb နှင့် တွဲသုံးရပြီး မြန်မာစကားတွင် “ -လုပ်လိုက်လို့ ပြောတယ်၊ _မလုပ်နဲ့လို့ ပြောတယ်” ဟု အဓိပ္ပာယ်ရသည်။ “ 으십시오, 으세요, -지 마세요” တို့၏ တစ်ဆင့်ပြောစကား (Indirect speech) ဖြစ်သည်။\n\n동작동사 뒤에 붙어서 간접적인 방법으로 명령문으로 의미를 전달합니다. ",
        "examples": "엄마가 집에 돌아오면 치킨 한 마리 사 오라고 하셨어요.\nMy mom told me to buy one chicken on the way home.\nကျွန်တော့်အမေက အိမ်ပြန်လာတဲ့ လမ်းမှာ ကြက်တစ်ကောင် ဝယ်လာခဲ့ပါလို့ မှာလိုက်တယ်။\n\n우리 엄마가 저한테 어른들에게 반말을 하지 말라고 합니다.\nMy mother told me that we shouldn’t use impolite speech forms to the elders.\nကျွန်တော့်အမေက ကျွန်တော့်ကို လူကြီးတွေကို  ရွယ်တူတွေလို မသုံးနှုန်းနဲ့လို့ ပြောတယ်။\n\n선생님이 저한테 공부 열심히 하라고 합니다.\nTeacher told me to study hard.\nဆရာမက ကျွန်တော့်ကို စာသေချာ ကြိုးစားပါလို့ပြောခဲ့တယ်။"
    },
    {
        "title": "달라고 하다",
        "explainations": "When the imperative forms of ‘주십시오, 주세요, 주어라’ from the action verb ‘주다’ is used in an indirect speech sentence, it can be used in two ways. When a speaker commands that something be given to another person , use ‘ 주라고 하다’.  But when the speaker is the recipient , use ‘ 달라고 하다’.\n\nဤအသုံးအနှုန်းကို နှစ်နေရာတွင် အသုံးပြုနိုင်သည်။ ပြောသူက နားထောင်သူကို တစ်ခုခု ခိုင်းစေသည့်အခါ” 주라고 하다“ နှင့် အသုံးပြုနိုင်ပြီး မြန်မာလိုဆိုလျှင် “ -ပေးလိုက်လို့ ပြောတယ်” ဟု အဓိပ္ပာယ်ရသည်။ နောက် ပြောသူက တစ်ယောက်ယောက်ကို တောင်းဆိုလိုက်၍ အကျိုးခံစားရသူဆိုလျှင် “ 달라고 하다”ကို အသုံးပြုနိုင်ပြီး မြန်မာစကားတွင် “ -ပေးပါလို့ ပြောလိုက်တယ်” ဟု အဓိပ္ပာယ်ရပါသည်။\n\n주체가 ‘ give ‘ 의 행위를 하는 경우, 즉 화자가 무언가를 하러 명령할 때 ‘ 주라고 하다’ 를 쓰며 주체가 “ take” 의 행위를 하는 경우, 즉 화자가 수취인일 때 “ 달라고 하다” 를 쓴다.",
        "examples": " 친구에게 이 숙제에 대해 도와 달라고 했다.\nI asked my friend to help me with this homework.\nကျွန်မ သူငယ်ချင်းကို ဒီအိမ်စာနဲ့ပတ်သက်ပြီး ကူပေးပါလားလို့ ပြောခဲ့တယ်။\n남동생이 자꾸 놀아 달라고 해요.\nMy little brother keeps asking me to play with him.\nကျွန်တော့် ညီလေးက ကျွန်တော်ကို သူနဲ့ ဆော့ပေးပါလို့ ပူဆာနေတယ်။\n\n다시 한 번 설명해 달라고 했습니다.\nI asked to have it explained to me one more time.\nနောက်တစ်ကြိမ် ထပ်ရှင်းပြပေးပါလို့ ပြောခဲ့တယ်။"
    },
    {
        "title": "아/어/여 야겠다",
        "explainations": "This grammar ending is used with a verb to show the speaker’s strong determination or that the performance must be done.\n\nဤအသုံးအနှုန်းသည် ပြောသူ၏ ဆုံးဖြတ်ချက် ခိုင်ခိုင်မာမာ ချထားမှုကို ဖော်ပြရာတွင် အသုံးပြုသည်။ မြန်မာစကားတွင် “-ရမှဖြစ်မယ်၊ -မှ ဖြစ်မယ်” ဆိုတဲ့ အဓိပ္ပာယ်သက်ရောက်ကာ Verbနောက်တွင် တွဲသုံးရသည်။\n\n동사 뒤에 붙어서 화자의 단단한 결정을 표현할 때 사용하다.",
        "examples": "가족 형편이 안 좋아져서 돈을 벌어야겠다.\nI have to earn money because my family’s situation is worse.\nအိမ်စီးပွားရေးအခြေအနေမကောင်းတော့လို့ ပိုက်ဆံရှာမှရတော့မယ်။\n\n이 방을 공부방으로 쓰려면 불이 더 밝아야겠다.\nThe light must be brighter if you want to use this room as a studying room.\nဒီအခန်းကို စာကြည့်ခန်းအဖြစ် အသုံးပြုချင်တယ်ဆိုရင်တော့ မီးအလင်းရောင်က ဒီထက် လင်းမှရမယ်။\n\n모델이 되려면 키가 더 커야겠다.\nYou should be taller if you want to be a model.\nမော်ဒယ်ဖြစ်ချင်ရင် ဒီထက် အရပ်ရှည်မှရမယ်။"
    },
    {
        "title": "게 되다",
        "explainations": "This can be used with an action verb to show the result happened without the speaker’s intention. Normally, it is used in a situation where the result was done by someone else’s influence, or by the influence of time.\n\nဤအသုံးအနှုန်းသည် Action verb နှင့် တွဲသုံးပြီး ပြောသူက မရည်ရွယ်ပဲဖြစ်သွားသည့်ကိစ္စများကို ရည်ညွှန်းရာတွင် သုံးသည်။ ပုံမှန်ဆိုလျှင် တစ်စုံတစ်ယောက် သို့မဟုတ် အချိန်ကြောင့် ဖြစ်သွားသော အဖြစ်အပျက်များကို ဖော်ပြရာတွင် သုံးသည်။ မြန်မာလိုဆိုလျှင် “ -ဖို့ ဖြစ်သွားတယ်” ဟု အဓိပ္ပာယ်ရသည်။\n\n동작동사와 붙여 쓰고 고의 아니게 벌어진 사건들을 언급할 때 쓴다. 평소에는 시간 그리고 누군가의 영향 때문에 벌어진 상황에도 쓴다.",
        "examples": " 엄마 강요 때문에 의대에 가게 되었어요.\nI entered medical university because of my mother’s enforcement.\nအမေ့ရဲ့ ဖိအားပေးမှုကြောင့် ဆေးတက္ကသိုလ် တက်ဖို့ ဖြစ်သွားတယ်။\n\n그 사람은 자동차 사고로 이제는 걷지 못하게 되었어요.\nHe couldn’t walk anymore because of his car accident case.\nကားတိုက်ပြီးတဲ့ နောက် သူ လမ်းမလျှောက်နိုင်ပဲဖြစ်သွားတယ်။\n\n오늘이 바빠서 점심 놓치게 되었다.\nI missed my lunch because I was so busy.\nဒီနေ့အလုပ်အရမ်းများနေလို့ နေ့လည်စာလွတ်သွားတယ်။"
    },
    {
        "title": "는 대로",
        "explainations": "It is used with an action verb to show the intention to carry out the action in the following clause as soon as the action described by the preceding verb is completed.\n\nဤအသုံးအနှုန်းသည် Action verb နှင့်တွဲသုံးရပြီး မြန်မာစကားတွင် “-ပြီးရင်- ပြီးချင်း “ ဟု အဓိပ္ပာယ်ရသည်။ ရှေ့က action ပြီးလျှင်ပြီးပြီးချင်း နောက်က action ကို ဆက်လုပ်ရန်ရည်ရွယ်ချက်ကို ဖော်ပြသည်။\n\n동작동사 뒤에 붙어서 쓰고 앞 행동이 끝나자 마자 또 다른 행위를 할 의지를 나타냅니다.",
        "examples": " 이 메시지를 보는 대로 나한테 연락 줘.\nCall me as soon as you see this message.\nဒီမက်ဆေ့ကို မြင်ပြီးရင် ချက်ချင်း ဆက်သွယ်ပါ။\n\n코로나  유행병이 사라지는 대로 여행을 가고 싶다.\nI want to travel as soon as corona is disappeared.\nကိုရိုနာရောဂါပြီးဆုံးပျောက်ကွယ်သွားရင် ခရီးထွက်ချင်တယ်။\n\n그 병태를 보는 대로 저 한테 말하세요.\nTell me as soon as you see that pervert.\nအဲ့ဒီနှာဘူးကောင်ကို တွေ့တွေ့ချင်း ပြောပါ။"
    },
    {
        "title": "에다가",
        "explainations": "This grammar point can be used with a noun to show the specific location of something. It is used only with transitive verb like ‘ 붙이다, 쓰다, 적다, 넣다, 놓다,꽂다’  and it is interchangeable  with ‘에’.\n\nဤအသုံးအနှုန်းသည်  Noun နှင့် တွဲသုံးရပြီး နေရာ သို့မဟုတ် တစ်ခုခုကို အသားပေးပြောရာတွင် သုံးသည်။ သို့ရာတွင် ထို Grammar အသုံးအနှုန်း၏နောက်တွင် ‘ 붙이다, 쓰다, 적다, 넣다, 놓다, 꽂다’ ကဲ့သို့သော ကံရှိ ကြိယာ (Transitive verb) များနှင့်သာ အသုံးပြုရသည်။ ‘에’ နှင့် အဓိပ္ပာယ်တူသည်။ “-မှာ “ ဟု အဓိပ္ပာယ်ရသည်။\n\n명사와 같이 붙여서 어떤 것의 위치를 강조하여 표시할 때 씁니다. 그러나 ‘ 붙이다, 쓰다, 적다, 넣다, 놓다, 꽂다’ 같은 타동사들하고만 사용해야 한다.",
        "examples": "편지 봉투에다가 주소를 쓰세요.\nPut your address on the envelope.\nမင်းလိပ်စာကို စာအိတ်ပေါ်မှာ ရေးပါ။\n\n이 서류에다가 사인 좀 해 주세요.\nPlease, sign on this document.\nဒီစာရွက်စာတမ်းပေါ်မှာ လက်မှတ်ထိုးပေးပါ။\n\n택시에다가 우산을 놓고 내렸어요.\nI left my umbrella in the taxi.\nကားပေါ်မှာ ထီးကျန်ခဲ့ပြီ။"
    },
    {
        "title": "ㅅ 동사",
        "explainations": "In some irregular  verbs that end with ‘ㅅ’ , eg. ‘긋다, 낫다, 붓다, 잇다, 젓다, 짓다….” , ‘ㅅ’ doesn’t drop when it is connected with an ending that begins a consonant like “ –고, -지만, -습니다 “.  But when it is connected with a vowel ending like ‘ –아/어/여요,  -아도/어도, -을까요? “ , ‘ㅅ’ drops.\n\nတစ်ချို့ ပုံမှန် မဟုတ်သော ကြိယာ (verb)  တစ်နည်းအားဖြင့် “ㅅ” နှင့်ဆုံးသော ပုံမှန်မဟုတ်သော ကြိယာများသည် ဗျည်းနဲ့စသော အဆုံးသတ် သို့မဟုတ် စာကြောင်းဆက် တွယ်ဆက်ကြိယာများ ဥပမာ : -고, -지만, -습니다 တို့နှင့် ဆက်လျှင် ထိုကြိယာတွင် ရှိသော “ㅅ” မှာ ပြုတ်ထွက်မသွားပါ။ သို့သော် သရနှင့် စသော အဆုံးသတ် သို့မဟုတ် စာကြောင်းဆက် ကြိယာများ ဥပမာ : -아/어/여요, -으면, -을까요? စသည်နှင့် တွဲမိလျှင်မူ ထို “ㅅ”မှာ ပြုတ်ထွက်သွားမည်ဖြစ်သည်။\n\n‘ㅅ’ 로 끝나는 어떤 동사들은 자음으로 한 연결 어미 즉 어미와 연결할 때는 ‘ㅅ’가 사라지지 않으며 모음으로 한 ‘-아/어/여요, -으면, -을까요’ 등 같은 연결 어미 또 어미들하고 연결할 때는 ‘ㅅ’ 가 사라지는 경우가 있다. 예를 들어, 긋다, 낫다, 짓다, 젓다, 잇다…등 같은 동사들이다.",
        "examples": "나는 깨진 찻잔을 아교로 이었다.\nI joined the two pieces of board together with glue.\nငါကွဲနေတဲ့ လက်ဖက်ရည်ခွက် အပိုင်းအစတွေကို ကော်နဲ့ ပြန်ဆက်ခဲ့တယ်။\n\n병이 나으면 기분도 나아질 거예요.\nYou would feel better when the illness is healed.\nရောဂါပျောက်သွားရင် နေလို့ကောင်းသွားမှာပါ။\n젓가락으로 젓지 말고 숟가락으로 저어서 드세요.\nDo not stir with chopsticks but with a spoon.\nတူနဲ့ မမွှေပဲ ဇွန်းနဲ့ မွှေပါ။"
    },
    {
        "title": "는/은/ㄴ 데다가",
        "explainations": "It is used with a verb to show that the action in the following clause occurs in addition to that stated in the preceding clause.\n\nVerb နှင့်တွဲသုံးရပြီး ပထမအကြောင်းအရာကို ပြောနေရာကနေ ဒုတိယအကြောင်းကိုပါ ထည့်ပြောလျှင် သုံးသည်။ မြန်မာစကားတွင်မူ “ -တဲ့ကြားထဲက  ၊  _ပြီး ” ဟု အဓိပ္ပာယ်ရပါသည်။",
        "examples": "비가 많이 오는 데다가 신발 끈이 풀려서 쓰러질 뻔했다.\nIt rained a lot and the shoelaces were loosened , so I almost fell down.\nမိုးတွေရွာနေတဲ့ကြားထဲ ဖိနပ်ကြိုးပါ ပြေသွားလို့ လဲကျတော့မလို ဖြစ်ခဲ့တယ်။\n\n숙제가 어려운 데다가 시간도 없어서 숙제를 할 수 없었어요.\nI couldn’t do my homework because the homework was not easy to do and in addition I didn’t have time.\nအိမ်စာက ခက်ပြီး အချိန်လည်းမရလို့ အိမ်စာမလုပ်ခဲ့ရဘူး။\n\n그 백화점이 값이 비싼 데다가 질도 안 좋아서 전 거의 안 갑니다.\nNot only the price of that supermarket is high, but also the quality of the products is not good either so I rarely go there.\nအဲ့ဒီကုန်တိုက်က ဈေးကြီးရုံတင်မက အရည်အသွေးလည်းမကောင်းလို့ ကျွန်မဆို သွားခဲတယ်။"
    },
    {
        "title": "지 말고",
        "explainations": "It is used with an action verb to tell someone not to do something. Following clause is often imperative sentence like ‘-으십시오/십시오,  -어라/아라/여라 ‘ or  propositive sentences like ‘ –읍시다/ㅂ 시다,  -자”.\n\nAction verb နှင့်တွဲသုံးရသည်။မြန်မာလိုဆိုလျှင် ‘ -မနေပဲ ၊ မ-ပဲ ‘ ဟု အဓိပ္ပာယ်ရပါသည်။ နောက်တွင် အမိန့်ပေးခိုင်းစေသောကြိယာများ၊ အကြံပြုသော အဆိုပြုသော ကြိယာများ လိုက်သည်။\n\n동작동사와 붙여서 어떤 것을 하지 않으려고 할 때 쓴다. 뒤에 명령형 또는 청유형 같은 문법들이 따라한다.",
        "examples": "그렇게 서 있지 말고 들어 와라.\nDon’t stand like that and come in.\nအဲ့လိုကြီး ရပ်မနေပဲနဲ့ ဝင်လာလေ။\n\n밥을 먹을 때 쩝쩝거리지 말아.\nDon’t smack and make a noise while you’re eating\nထမင်းစားနေတုန်း ပလပ်ပလပ်အသံမထွက်စေနဲ့။\n\n바다로 가지 말고 산으로 갑시다.\nLets go to the mountain, not a beach.\nပင်လယ်ဘက်မသွားပဲ တောင်တက်ရအောင်။"
    },
    {
        "title": "기 위해서",
        "explainations": "This form can be used together with an action verb to show purposes or intentions. In other words, the second clause shows the effort in order to proceed the purpose from the preceding clause. It is also used with noun in the form of ‘ 을/를 위해서’.\n\nAction verb နောက်တွင် သုံးရသည်ဖြစ်ကာ ရည်ရွယ်ချက်တစ်ခုခုကို ပြချင်ရာတွင် သုံးသည်။ တစ်နည်းအားဖြင့်ဆိုရလျှင် ဒုတိယဝါကျက ရှေ့ဝါကျ ပြီးမြောက်ဖို့အတွက် ရည်ရွယ်ခြင်း၊ အားစိုက်ခြင်းကို ဖော်ပြရာတွင်သုံးသည်။ Noun နှင့်တွဲသုံးမည်ဆိုလျှင် ‘을/를 위해서’ ပုံစံနှင့် သုံးရသည်။\n\n동작동사 뒤에 붙어서 쓰고 어떤 목적, 즉 의지를 나타냅니다. 명사 뒤에서 쓴다면 ‘ 을/를 위해서’ 와 같이 쓴다.",
        "examples": "유학 가기 위해 지금 열심히 공부하고 있습니다.\nI study hard to go study abroad.\nပညာတော်သင်သွားနိုင်ဖို့ အခု စာတွေ အများကြီး ကြိုးစားနေပါတယ်။\n\n학비를 벌기 위해 알바를 했어요.\nI worked part-time in order to save money for my tuition.\nကျောင်းလခအတွက် အချိန်ပိုင်းအလုပ် လုပ်ခဲ့တယ်။\n\n사랑하는 가족을 위해서 열심히 일 하고 있습니다.\nI work hard for my beloved family.\nချစ်ရတဲ့မိသားစုအတွက် ကြိုးကြိုးစားစား အလုပ်လုပ်နေပါတယ်။"
    },
    {
        "title": "아무",
        "explainations": "It is used with nouns of time, place, thing , person, etc. and indicates not only a particular thing but all.\n\nNoun နောက်တွင် ကပ်ကာ အသုံးပြုရပြီး အချိန်၊ အရာဝတ္ထု၊ နေရာ၊ လူ အစရှိသဖြင့် တွဲသုံးနိုင်ကာ တစ်ခုတည်းကို ညွှန်းဆိုခြင်းမဟုတ်ပဲ အားလုံးကို ညွှန်းဆိုသည်။\n\n명사 뒤에 붙어서 쓰고 시간, 장소, 물건, 사람 등으로 같이 쓸 수 있으며 다양성을 가리킵니다.",
        "examples": " 아무 데나 갑시다.\nLet’s go anywhere.\nဘယ်နေရာဖြစ်ဖြစ် သွားကြရအောင်။\n\n아무나 말해도 상관 없습니다.\nAnyone can tell this. It doesn’t matter.\nဘယ်သူမဆို ပြောလို့ရပါတယ်။\n\n우리 집에 아무 때나 와도 좋아요.\nYou can come to my house anytime you want.\nငါတို့အိမ်ကို မင်း ဘယ်ချိန်မဆို လာလို့ရပါတယ်။"
    },
    {
        "title": "얼마나 –는지, 은지, ㄴ 지 모르다",
        "explainations": "This grammar is used with a verb to emphasize the fact in the verb.\n\nVerb နှင့် တွဲသုံးရပြီး အချက်တစ်ချက်ကို အသားပေးဖော်ပြချင်သောအခါမျိုးတွင် အသုံးပြုသည်။ မြန်မာလိုဆိုလျှင် “ ဘယ်လောက်တောင် - လဲဆိုတာ “ ဟု အဓိပ္ပာယ်ရသည်။\n\n동사 뒤에 붙여 무언가를 강조하여 말하고 싶을 때 쓴다.",
        "examples": "내가 널 얼마나 보고 싶은지 알아?\nDo you know how much I miss you?\nငါမင်းကို ဘယ်လောက်လွမ်းနေလဲသိလား?\n\n이 수학 문제는 얼마나 어려운지 몰라.\nYou can’t imagine how difficult that one is.\nဒီပုစ္ဆာ ဘယ်လောက်ခက်ခဲလဲ မင်းမသိပါဘူး။\n\n내가 봤던 그 여자가 얼마나 예쁜지 너희는 상상도 못해.\nYou guys can’t imagine how pretty she is.\nငါတွေ့ခဲ့တဲ့ ကောင်မလေး ဘယ်လောက်တောင်လှလဲ မင်းတို့တွေးတောင်တွေးမိမှာ မဟုတ်ဘူး။"
    },
    {
        "title": "나, 은가/ ㄴ 가 보다",
        "explainations": " It is used together with a verb to express prediction. Especially , it is used when a speaker makes a supposition from the past experience or something the speaker interpreted from an observed fact, not any direct experience. In case of action verbs and past tenses, it is used as ‘ –나 보다’, and in case of descriptive verbs ‘ – 은가/ ㄴ 가 보다’ is used.\n\nဤအသုံးအနှုန်းသည် verb နှင့် တွဲသုံးရပြီး ခန့်မှန်းချက်ကိုဖော်ပြရာတွင် သုံးသည်။ အထူးသဖြင့် ပြောသူသည် အတိတ်က အတွေ့အကြုံနှင့် ပတ်သက်၍ စိတ်မှန်းနှင့် ပြောရာတွင်လည်းကောင်း၊ ပြောသူကိုယ်တိုင် တွေ့ကြုံရသည်မဟုတ်သော်လည်း တွေ့ရှိခဲ့သော အချက်များနှင့် ယှဥ်ကာ မှန်းဆ ရာတွင်လည်းကောင်းသုံးသည်။ Action verb နှင့် အတိတ်ကာလပြကြိယာများသည် ‘-나 보다’ နှင့်တွဲရပြီး Descriptive verb များသည် ‘ –은가 /ㄴ 가 보다’ နှင့် တွဲသုံးရသည်။ မြန်မာလိုဆိုလျှင် ‘- တယ် ထင်တယ်’ ဟု အဓိပ္ပာယ်ရသည်။\n\n추측할 때 쓴다. 특히 화자가 예전에 겪었던 사건에 대해서 추측으로 할 때, 또는  화자가 직접적으로 겪은 건 아니지만 펙트들 보고 예측할 때 쓴다. 동작동사와 과거 동사들은  “ –나 보다” 와 같이 사용하고 서술 동사들은 “ –은가/ ㄴ 가 보다” 와 같이 쓴다.",
        "examples": "옆 방에 누가 있나 봐요. 걸음 소리가 들려요.\nThere seems to be somebody in the next room. I heard somebody is walking.\nဘေးခန်းမှာ တစ်ယောက်ယောက်ရှိတယ်နဲ့ တူတယ်။ လမ်းလျှောက်သံ ကြားရတယ်။\n\n급하게 걷는 걸 보니까 무슨 급한 일이 있나 봐요.\nHe must have something important to do since he is walking quickly.\nမြန်မြန်လမ်းလျှောက်နေတာကို ကြည့်ရတာ သူ အရေးကြီးကိစ္စ ရှိတယ်နဲ့ တူတယ်။\n\n그 여자가 날 싫어하나 봐. 자꾸 곁눈질하네 나한테.\nShe must be hate me because she cast a side glance to me again and again.\nသူ ငါ့ကိုမျက်စောင်းခဏခဏထိုးနေပုံထောက်ရင် သူ ငါ့ကို မုန်းနေပုံရတယ်။"
    },
    {
        "title": "밖에",
        "explainations": "It comes after a noun and shows there aren't any options to choose. Negative forms like ‘ 안, 못, 없다, 모르다’ are used together.\n\nNoun နောက်နားကပ်ကာ အသုံးပြုရပြီး ဒီတစ်ခု အပြင် ရွေးချယ်စရာမရှိသောအခါတွင် သုံးသည်။ နောက်တွင် အငြင်းသဘောဆောင်သော ‘안, 못, 없다, 모르다’ တို့ ကပ်သည်။ မြန်မာစကားတွင် ‘-အပြင်’ ဟု အဓိပ္ပာယ်ရသည်။\n\n명사 뒤에 붙어서 써야 하고 선택권이 없을 때 쓴다.",
        "examples": "손님이 두 명밖에 안 왔어요.\nThere were only two customers.\nဧည့်သည်က နှစ်ယောက်အပြင် မလာဘူး။\n\n나한테 남은 건 이 것밖에 없어.\nThis is the only one left.\nငါ့ဆီမှာ ဒီတစ်ခုပဲ ကျန်တော့တာ။\n\n나를 도와줘서 고마워. 진짜 너밖에 없어.\nThank you for helping me. You are the only one.\nငါ့ကို ကူညီပေးလို့ ကျေးဇူးတင်ပါတယ်။ တကယ့်ကို နင့်အပြင်မရှိဘူး။"
    },
    {
        "title": "았던/었던/였던",
        "explainations": "It is used together with a verb to express a recollection of past experiences that happened just one time and did not continue to the present, or past fact that is different from the present.\n\nVerb နောက်တွင်သုံးရသည်ဖြစ်ပြီး အတိတ်က ဖြစ်ခဲ့သော အကြောင်းအရာများကို ဖော်ပြရာတွင် သုံးသည်။ သို့ရာတွင် ထိုအကြောင်းအရာများသည် တစ်ခါသာဖြစ်ကာ ပစ္စပ္ပုန်တွင် ဆက်မဖြစ်သော အကြောင်းအရာများသာဖြစ်သည်။ မြန်မာလိုဆိုလျှင် “ -ခဲ့တဲ့ “ ဟု အဓိပ္ပာယ်ရသည်။\n\n동사 뒤에 붙어서 쓰고 과거에 생겼던 사실들을 말하고 싶을 때 쓴다.그 과거에 일어난 사실들이 단 한 번만 벌어진 사건이고 현실까지 이어지지 않는 사건들이다.",
        "examples": "나무가 많았던 숲에 이제는 큰 공장이 세워졌다.\nA big factory was built in the forest where there used to be a lot of trees.\nတစ်ချိန်က သစ်ပင်တွေအများကြီးရှိခဲ့တဲ့ သစ်တောထဲမှာ အခုတော့ စက်ရုံကြီးတစ်ရုံ ဆောက်လိုက်ပြီ။\n\n예전에 나 때문에 아빠가 화 많이 했던 순간이 있었어.\nThere was a time when my father was so mad because of me.\nအရင်တုန်းက ငါ့ကြောင့် ငါ့အဖေ ဒေါသအကြီးအကျယ်ထွက်ဖူးတယ်။\n\n내가 어렸을 때 자주 갔던 맛집이 이제는 없어졌다.\nThe restaurant I used to go to has disappeared.\nငယ်ငယ်တုန်းက သွားနေကျ ဆိုင်က အခု မရှိတော့ဘူး။"
    },
    {
        "title": "의",
        "explainations": "It is a particle used with a noun to connect two nouns together, to show the following noun is a possession, position, location, etc. of the preceding noun.\n\n၎င်းသည် ပစ္စည်း (particle)  တစ်ခုဖြစ်ကာ noun နှစ်ခုကို ဆက်သွယ်ရာတွင် သုံးသည်။ နောက်က လိုက်သော noun မှာ ရှေ့ noun ၏ ပိုင်ဆိုင်ခြင်း၊ တည်နေရာ၊ တစ်စုံတစ်ရာဖြစ်ကြောင်းကို ပြသသည်။\n\n명사와 붙여 명사 두 게를 연결하여 쓰며 뒤에 있는 명사가 앞에 있는 명사의 소유, 위치 또는 무언가임을 나타냅니다.",
        "examples": "그 가수의 목소리가 너무 특별해요.\nThe voice of that singer is spectacular.\nအဲ့ဒီအဆိုတော်ရဲ့ အသံက ထူးခြားတယ်။\n\n서울은 한국의 도시이다.\nSeoul is the city of South Korea.\nဆိုးလ်မြို့က တောင်ကိုးရီးယားရဲ့ မြို့တော်ဖြစ်ပါတယ်။\n\n독도는 경상북도의 한 섬이다.\nDok-do is one of the islands in Gyeongsangbukdo.\nဒုခ်ဒိုကျွန်းဟာ ဂယောင်းဆန်းဘုခ်ဒိုဘက်မှာရှိတဲ့ ကျွန်းတစ်ကျွန်းဖြစ်ပါတယ်။"
    },
    {
        "title": "던",
        "explainations": "It comes after a verb to express the fact in the past  which continues for a certain period of time or that is ongoing and not yet completed to the present.\n\nverb နှင့် တွဲသုံးရပြီး အတိတ်ကာလကိုဖော်ပြရာတွင် သုံးသည်။ ထို အတိတ်ကာလက အရာများသည် ယခုအချိန်ကာလတစ်ခုထိ ဆက်လက်ဖြစ်ပျက်နေသည်မျိုး၊ ဆက်လက်ဖြစ်ပျက်နေသော်လည်း ယခုထိ မပြီးပြတ်သေးသော အကြောင်းအရာများဖြစ်သည်။ မြန်မာလိုဆိုလျှင် “ -ခဲ့တဲ့” ဟု အဓိပ္ပာယ်ရသည်။\n\n동사와 같이 사용하여 지난 과거에 대해서 말하고 싶을 때 쓴다. 그 과거의 벌어진 무언가는 지금까지 벌어지고 있는데 아직까지 끝나지 않는 것들이다.",
        "examples": "오빠가 입던 옷을 제가 입고 있어요.\nI am wearing the clothes that my brother used to wear.\nကျွန်တော့်အစ်ကို ဝတ်ခဲ့တဲ့ အင်္ကျီကို ကျွန်တော် ဆက်ဝတ်နေတယ်။\n\n보고 있던 텔레비전을 끄고 자려고 준비했다.\nI closed the television and tried to sleep.\nကြည့်နေတဲ့ တီဗီကို ပိတ်ပြီး အိပ်ဖို့ပြင်ဆင်ခဲ့တယ်။\n\n너무 재미있으니까 울던 아이도 웃고 있어요.\nIt was so funny that the child who had been crying is now laughing.\nအဲ့ဒါက အရမ်းစိတ်ဝင်စားဖို့ကောင်းလို့ ငိုနေတဲ့ ကလေးတောင် ရယ်နေတယ်။"
    },
    {
        "title": "만에",
        "explainations": "It is used with a time pattern as a noun to show the interval of time that has elapsed before the following action occurred.\n\nအချိန်ပြနာမ် (Time Noun) နှင့် တွဲသုံးရကာ အချိန်တစ်ခု ကြာပြီးမှ တစ်ခုခုကို ပြန်ပြီးလုပ်ဖြစ်တဲ့အခါမျိုးတွင် သုံးသည်။ မြန်မာလိုဆိုလျှင် “ - ပြီးမှ “ဟု အဓိပ္ပာယ်ရသည်။\n\n명사 (시간) 뒤에다가 붙여 써야 하고 다음 행위가 벌어지기 전에 경과한 시간 간격을 표시할 때 쓴다.",
        "examples": "오랜만에 널 만나게 되니 얼마나 기쁜지 몰라.\nYou don’t know how happy I am to see you after such a long time.\nတော်တော်ကြာမှ မင်းကို ပြန်တွေ့ရတာ ငါဘယ်လောက်ပျော်လဲမင်းသိလား?\n\n두 달만에 다시 영화관에 가서 영화 보게 돼요.\nI am going to watch the movie in the theatre in two months.\nနှစ်လနေပြီးမှ ရုပ်ရှင်ရုံသွားပြီး ရုပ်ရှင်ပြန်ကြည့်ဖြစ်တာပဲ။\n\n8개월만에 고향에 다시 돌아갈 수 있게 되었다.\nAfter eight months, I was able to go back to my hometown.\n၈လကြာမှ မွေးရပ်မြေကို ပြန်ဖြစ်ခဲ့တယ်။"
    },
    {
        "title": "만큼",
        "explainations": " It is used with a noun to show the similarity.\n\nnoun နှင့်တွဲသုံးရပြီး တူညီမှုကို ပြချင်သောအခါတွင်သုံးသည်။ မြန်မာလိုဆိုလျှင် “ -လောက် ၊ -လိုမျိုး ” ဟု အဓိပ္ပာယ်ရသည်။\n\n명사 뒤에 붙어서 비슷함을 표현한다.",
        "examples": "너만큼 좋은 사람이 한 번도 본 적이 없어.\nI have never seen a good person like you.\nမင်းလိုလူကောင်းမျိုး ငါတစ်ခါမှ မတွေ့ဖူးဘူး။\n\n난 미미만큼 예쁜 여자 본 적 없어.\nI have never seen a pretty girl like MiMi.\nမီမီလိုမျိုးလှတဲ့ ကောင်မလေးမျိုး ငါတစ်ခါမှ မတွေ့ဖူးဘူး။\n\n고래만큼 큰 동물은 없어요.\nThere isn’t any animal as big as whales.\nဝေလငါးတွေလောက် ကြီးတဲ့ တိရစ္ဆာန်မျိုးမရှိဘူး။"
    },
    {
        "title": "아서/어서/여서 그런지",
        "explainations": "This grammar pattern is used together with a verb to convey an imprecise reason to explain the following situation.\n\nVerb နှင့်တွဲသုံးရပြီး မြန်မာလိုဆိုလျှင် “ -လို့လားမသိ” ဟု အဓိပ္ပာယ်ရသည်။ အကြောင်းပြချက်ပေးရသော ပုံစံဖြစ်သော်လည်း မရေရာသော အကြောင်းပြချက်မျိုးဖြစ်သည်။\n\n동사와 같이 사용하여 이유를 선언하고자 하는데 그 이유가 정확하지 않을 때 쓴다.",
        "examples": "하루종일 비가 와서 그런지 기분이 우울하네.\nI feel gloomy maybe because it is raining all day.\nမိုးတစ်နေကုန် ရွာနေလို့လားမသိ ခံစားချက်ကြီးက တစ်မျိုးကြီးပဲ။\n\n혼자 여행을 가서 그런지 좀 불안해요.\nI feel unsafe maybe because I travel alone.\nတစ်ယောက်တည်းခရီးသွားရလို့လားမသိ နည်းနည်းမလုံခြုံသလိုခံစားရတယ်။\n\n아까 영양제를 마셔서 그런지 힘을 차오르는 느낌이네.\nI feel like I am full of energy maybe because I drank a nutritional supplement.\nခုနက အားဆေးသောက်လိုက်လို့လားမသိ အားတွေပြည့်တက်လာသလိုပဲ။"
    },
    {
        "title": "더군요",
        "explainations": "This pattern is used with a verb to express the fact which a speaker learned from his/her own experiences.\n\nVerb နောက်ကပ်ကာ အသုံးပြုရပြီး ပြောသူဟာ သူ အတိတ်က မြင်ခဲ့ကြားခဲ့ ခံစားခဲ့ရတာတွေကို ပြန်ပြောပြတဲ့ အချိန်တွင် သုံးသည်။\n\n동사 뒤에 붙여서 화자가 보고 느낀 것을 회상하거나 알릴 때 쓴다.",
        "examples": " 제 친구 신부가 너무 예쁘더군요.\nMy friend is really stunning in bridal style.\nကျွန်မသူငယ်ချင်း သတို့သမီးလေးက အရမ်းလှနေခဲ့တာ။\n\n그 이야기를 제 친구에게서 듣더군요.\nI heard about that case from my friend.\nကျွန်တော်ဒီအကြောင်းကို သူငယ်ချင်းဆီကနေ ကြားခဲ့တာ။\n\n제가 너무 좋아한 옷인데 너무 비싸더군요.\nI couldn’t buy that one because it was so expensive.\nကျွန်မ အရမ်းကြိုက်တဲ့ အင်္ကျီပေမယ့် ဈေးကြီးလို့ မဝယ်ခဲ့ဘူး။"
    },
    {
        "title": "Conjunction",
        "explainations": " A word that joins words , phrases or sentences such as “그래도, 그래서, 그러나, 그러니까, 그런데, 그렇지만 “ (though, so that, but, therefore, however) and so on.\n\nconjunction ဆိုသည်မှာ စကားလုံးများ၊ ပုဒ်စုများ၊ စာကြောင်းများ စသည်တို့ကို ဆက်သွယ်ပေးသောအရာဖြစ်သည်။ ဥပမာ - ဒါပေမယ့်လည်း၊ အဲ့ဒါကြောင့်၊ ဒါပေမယ့်၊ အဲ့ဒါကြောင့်မို့လို့ စသဖြင့် သမ္ဗန္ဓများစွာ ရှိသည်။\n\n접속사는 단어와 단어, 구절과 구절, 문장과 문장을 이어 주는 기능을 하는 문장 성분입니다. 예를 들으면 , “그런데, 그러니까, 그래도, 그래서, 그렇지만” 등이 있다.",
        "examples": "우리 같이 갔던 식당이 너무 맛이 좋지? 그렇지만 너무 비싸.\nThe taste of the restaurant we went to together is really good, isn’t it? But it is costly.\nငါတို့သွားခဲ့တဲ့စားသောက်ဆိုင်ကတော်တော် အရသာကောင်းတယ်နော်? ဒါပေမယ့် အရမ်းဈေးကြီးတာပဲ။\n\n저는 친구와 저녁을 같이 먹었어요. 그리고 영화도 같이 봤어요.\nI ate dinner together with my friend and also watched a movie.\nကျွန်တော် မနေ့က သူငယ်ချင်းတစ်ယောက်နဲ့ ညနေစာတူတူစားခဲ့တယ်။ ပြီးတော့ ရုပ်ရှင်လည်း ကြည့်ခဲ့တယ်။\n\n어제 제가 비 맞았어요. 그러니까 열이 났어요.\nI got rained yesterday. Therefore I had a fever.\nမနေ့က မိုးမိခဲ့တယ်။ အဲ့ဒါကြောင့် ဖျားခဲ့တယ်။"
    },
    {
        "title": "으면/면  -을 수록/ㄹ 수록",
        "explainations": "This grammar pattern is used with a verb to indicate that the action or condition in the first clause increases, the action or condition in the second clause will inversely or proportionately increase.\n\nVerb နှင့်တွဲသုံးရသည်။ မြန်မာလိုဆိုလျှင် “ -ရင် -လေလေ” ဟု အဓိပ္ပာယ်ရသည်။\n\n동사 뒤에 붙여서 천 번째 절의 작용 또는 상황이 증가하면 두 번째 절의 작용과 조건도 반비례 또는 비례적으로 증가합니다.",
        "examples": " 술은 마시면 마실 수록 더 마시고 싶어져.\nThe more you drink, the more you want to drink.\nအရက်က သောက်ရင် သောက်လေလေ ထပ်သောက်ချင်နေတာ။\n\n이 초코케이크는 먹으면 먹을 수록 맛있다.\nThe more I eat this chocolate cake, the more delicious it is.\nဒီချောကလက်ကိတ်က စားရင် စားလေလေ အရသာရှိတယ်။\n\n한국어는 배우면 배울 수록 재미있어요.\nThe more I study Korean language, the more interested it is.\nကိုးရီးယားဘာသာစကားက သင်လေလေ စိတ်ဝင်စားဖို့ကောင်းလာလေလေပဲ။"
    },
    {
        "title": "는/은/ㄴ 줄 알다",
        "explainations": "This pattern is used together with a verb to state that the speaker’s realization or assumption was incorrect. Although he/she made a prediction, that is different from the actual result of the incident and a final ending connects to a past tense. When the incident occurs at present time, it is used as ‘ 는 줄 알다 ‘. In case of the incident already occurred , it is used as ‘은/ㄴ 줄 알다 ‘. In case of the incident is going to be occurring, ‘ 을/ㄹ 줄 알다’ is used.\n\nမြန်မာလိုဆိုလျှင် ‘ - တယ်လို့ ထင်ခဲ့ပေမယ့်” ဟု အဓိပ္ပာယ်ရပါသည်။ ပြောသူက ကြိုတင်မှန်းဆခဲ့ပေမယ့် မှန်းဆချက်က လွဲသွားသောအခါတွင် အသုံးပြုသည်။ လက်ရှိအချိန် ဖြစ်ပျက်နေလျှင် “ 는 줄 알다” ကိုသုံးပြီး အတိတ်မှာ ဖြစ်ပျက်ခဲ့တာကို သုံးလျှင် “ 은/ㄴ 줄 알다” ကိုသုံးကာ အနာဂတ်မှာ ဖြစ်မှာကို မှန်းဆလျှင်တော့ “ 을/ㄹ 줄 알다 “ ကို သုံးသည်။\n\n동사 뒤에 쓰여 화자가 한 가정이나 깨달음이 사실과 다르게 나타날 때 쓰다.",
        "examples": " 미소 씨가 오늘 학교에 오실 줄 알았는데 안 오네.\nI thought Miso would come to school today. But she won’t .\nကျွန်တော်က မီဆို ဒီနေ့ ကျောင်းလာမယ်ထင်တာ။ သူမလာဘူးပဲ။\n\n제가 초초를 중국 사람인 줄 알았어요.\nI thought cho cho was a Chinese. But I was wrong.\nကျွန်မက ချိုချို့ကို တရုတ်လူမျိုးလို့ ထင်ခဲ့တာ။\n\n체리 씨가 유부녀예요? 반지를 안 껴서 미혼자인 줄 알았어요.\nIs cherry married? I thought she was single because she didn’t wear any rings on her ring finger.\nချယ်ရီက လက်ထပ်ထားတာလား? ဪ သူ့လက်သူကြွယ်မှာ လက်စွပ်မဝတ်ထားတော့ ဆင်ဂယ်ထင်ခဲ့တာ။"
    },
    {
        "title": "처럼",
        "explainations": "It is used with a noun to show something is similar.\n\nNoun နှင့်တွဲသုံးရပြီး မြန်မာလိုဆိုလျှင် “ လိုမျိုး” ဟု အဓိပ္ပာယ်ရသည်။\n\n명사 뒤에 붙여서 쓰며 비슷함을 보여줄 때 쓴다.",
        "examples": " 꼬꼬 씨는 모델처럼 키가 커요.\nKo Ko is so tall like a model boy.\nကိုကိုက မော်ဒယ်တစ်ယောက်လိုပဲ အရပ်ရှည်တယ်။\n\n마리아 씨는 가수처럼 노래를 잘 부를 수 있어요.\nMaria can sing a song well like a singer.\nမာရီယာက အဆိုတော်တစ်ယောက်လိုပဲ သီချင်းကောင်းကောင်းဆိုနိုင်တယ်။\n\n에리엘 씨는 여배우처럼 너무 예뻐요.\nArial is so pretty like a female movie star.\nအေရီယယ်က အမျိုးသမီးသရုပ်ဆောင်တစ်ယောက်လိုပဲ လှလိုက်တာ။"
    },
    {
        "title": "덕분에",
        "explainations": "This pattern is used with a noun to indicate the positive effect of action or state. So, it translates to “thanks to”.\n\nဤအသုံးအနှုန်းမှာ မြန်မာလိုဆိုလျှင် “ - ကျေးဇူးကြောင့်” ဟု အဓိပ္ပာယ်ရသည်။ Noun နှင့် တွဲသုံးရသည်။\n\n명사 뒤에 사용하여 은혜나 도움을 의미하는 말임으로,긍정적인 의사를 표시하는 문장에 쓴다.",
        "examples": "오빠 덕분에 대학 입학시험을 잘 볼 수 있었다.\nThanks to my brother, I can do well on the college entrance exam.\nကျွန်မအစ်ကို ကျေးဇူးကြောင့် ကောလိပ်ဝင်ခွင့်စာမေးပွဲကို ကောင်းကောင်းဖြေနိုင်ခဲ့တယ်။\n\n장학금 덕분에 좋은 외국 대학을 다녔어요.\nI was able to study at a good foreign university thanks to a scholarship.\nပညာသင်ဆုကျေးဇူးကြောင့် နိုင်ငံခြားတက္ကသိုလ်ကောင်းကောင်းကို တက်နို်ငခဲ့တယ်။\n\n잘 가르쳐 주신 삼촌 덕분에 운전 잘 할 수 있었고 운전 면허 시험도 잘 칠 수 있었다.\n\nI could drive pretty well and did well on my driving test thanks to my uncle.\n\nကောင်းကောင်းသင်ပေးခဲ့တဲ့ ဦးလေးကျေးဇူးကြောင့် ကားလည်းကောင်းကောင်းမောင်းတတ်ပြီး ကားမောင်းစစ်စာမေးပွဲမှာလည်း ကောင်းကောင်းဖြေနိုင်ခဲ့တယ်။"
    },
    {
        "title": "으면서/면서",
        "explainations": "This connective ending is used to express two simultaneous actions done by the same person. It is used with an action verb.\n\nAction verb နှင့်တွဲသုံးရပြီး လူတစ်ယောက်တည်းက တစ်ပြို်ငနက်တည်း အရာနှစ်ခုကို လုပ်တဲ့အခါမျိုးတွင် သုံးသည်။ မြန်မာလိုဆိုလျှင် “ - ရင်းနဲ့ “ ဟု အဓိပ္ပာယ်ရသည်။\n\n동작동사와 붙여 사용하고 한 사람이 동시에 두까지 일을 하게 될 때 쓴다.",
        "examples": " 엄마가 설거지를 하면서 통화하고 있어요.\nMom is on the phone and doing the dishes at the same time.\nအမေက ပန်းကန်ဆေးရင်းနဲ့ ဖုန်းပြောနေတယ်။\n\n그 여자는 운전하면서 노래 듣고 있어요.\nShe is listening to music while driving.\nအဲ့ကောင်မလေးက ကားမောင်းရင်းနဲ့ သီချင်းနားထောင်နေတယ်။\n\n오빠는 게임을 하면서 라면 먹고 있어요.\nMy brother is eating noodles while playing games.\nအစ်ကိုက ဂိမ်းဆော့ရင်းနဲ့ ခေါက်ဆွဲပြုတ်စားနေတယ်။"
    },
    {
        "title": "을/ㄹ 테니까",
        "explainations": "This pattern is used with an action verb. It is a combination  of ‘을/ㄹ 터이다’ , which expresses the speaker’s supposition or intention, and  ‘-으니’ , which expresses a reason. The second clause contains the speaker’s suggestion or statement of advice to the listener while the first clause provides the speaker’s reason for giving such a suggestion or advice.\n\nAction verb နှင့် တွဲသုံးရပြီး မြန်မာလိုဆိုလျှင် “ -မှာမို့လို့ ၊ -ဆိုတော့ “ ဟုအဓိပ္ပာယ်ရသည်။ နောက်ဝါကျတွင် ပြောသူ၏ အကြံပေးချက် သို့မဟုတ် အဆိုပြုချက် ပါဝင်ပြီး ရှေ့ဝါကျတွင် ပြောသူပေးမည့် အဆိုပြုချက်အတွက် အကြောင်းပြချက်ပါဝင်ရမည်ဖြစ်သည်။\n\n동작동사와 같이 쓰고 말하는 사람이 어떤 일을 하겠다는 의지나 의도를 나타낼 때 사용한다.",
        "examples": " 비 올 테니까 우리 집으로 가겠습니다.\nSince it looks like rain, we should go home.\nမိုးရွာတော့မှာမို့လို့ အိမ်အရင်ပြန်သင့်တယ်။\n운동을 많이 했으니 피곤할 테니까 일찍 자세요.\nYou are probably tired because you did so many exercises, so you should go to sleep early.\nအားကစားအများကြီးလုပ်ထားလို့ ပင်ပန်းနေမှာဆိုတော့ စောစောအိပ်သင့်တယ်။\n\n초콜릿을 많이 먹으면 살이 찔 테니까 많이 먹지마.\nYou might gain weight if you eat chocolate a lot, so don’t eat a lot.\nချောကလက်အများကြီးစားရင် ဝိတ်တက်မှာဆိုတော့ အများကြီးမစားနဲ့။"
    },
    {
        "title": "기 때문에",
        "explainations": "(ကြိယာ+기 때문에)_ကြောင့်/လို့\n\nIt is used with a verb showing a reason only when the causes and effects are definite.It is often used in a written form rather than in spoken language.\n\n동사와 붙이고 어떤 상황이 나타난 이유를 표현할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးကိစ္စတစ်ခုဖြစ်လာရခြင်း၏အကြောင်းရင်းကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင် \"ဒါလုပ်လိုက်တဲ့အတွက်ကြောင့်၊ဒါ ဖြစ်တာကြောင့်၊ဒါဖြစ်လို့ \"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။\n\n",
        "examples": "하루 종일 일 하기 때문에 많이 힘들고있어요.\n(I'm very tired because I am working all day)(တစ်နေ့လုံးအလုပ်လုပ်ထားလို့အရမ်းပင်ပန်းနေပြီ။)\n\n큰 수술을 했기 때문에 움직일 수 없어요.\n(I can't move properly because I had a major operation)\n(အကြီးစားခွဲစိတ်မှုလုပ်ခဲ့တာကြောင့်လှုပ်လို့မရပါဘူး။)\n\n요즘 방학이기 때문에 한가합니다.\n(I'm free because it is a holiday now.)\n(အခုလက်တလောက ပိတ်ရက်ဖြစ်နေလို့ အားပါတယ်။)"
    },
    {
        "title": "때문에",
        "explainations": "(နာမ်+때문에)တစ်စုံတစ်ခုကြောင့်\n\nIt is used with a noun showing a reason.\n\n명사와 붙이고 이유를 표현할때 사용한다.\n\nနာမ်နှင့်တွဲသုံးပြီးတစ်စုံတစ်ခုကြောင့်ကိစ္စတစ်ခုဖြစ်ရသည်ဟုဖော်ပြရာတွင်အသုံးပြုသည်။အများအားဖြင့် တစ်စုံတစ်ခုကြောင့်မကောင်းသောရလဒ်များဖြစ်လာရသည့်အခါ၊မကောင်းမြင်စိတ်ဖြင့်ပြောလိုသည့်အခါတွင်သုံးပါသည်။မြန်မာစကားတွင်\"နင့်ကြောင့်မို့  အဲဒီ့ဟာကြောင့်\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "시험 때문에 잠을 못 잤어요.\n(I can't sleep well because of exam.)\n(စာမေးပွဲကြောင့်အိပ်လို့တောင်မပျော်ဘူး)\n\n코로나 때문에 밖에 나갈 수 없어요.\n(We can't go outside because of corona.)\n(ကိုရိုနာကြောင့်မို့အပြင်ထွက်လို့မရပါဘူး။)\n\n아이들 때문에 행복합니다.\n(I am happy because of my children.)\n(ကလေးတွေကြောင့်ပျော်ရပါတယ်။)"
    },
    {
        "title": "이든지/든지",
        "explainations": "(အမေးပုံစံ+이든지/든지)ဖြစ်ဖြစ်၊ဖြစ်စေ\n\nIt is used with an interrogative form like when,where,who,what and how many,etc' to mean that the action or the state is not limited or selected.\n\n언제,어디,누구,무엇,얼마 등 의문문과 같이 사용하고 어떤 활동이나 제안하지 않은것을 표현한다.\n\nအမေးပုံစံဖြစ်သည့် ဘယ်အချိန်လဲ၊ဘယ်မှာလဲ၊ဘယ်သူလဲ၊ဘယ်လောက်လဲ၊ဘာလဲ တို့နှင့်တွဲသုံးပြီး ကန့်သတ်ထားတာမျိုးမရှိဘယ်ချိန်ဖြစ်ဖြစ်၊ဘယ်သူဖြစ်ဖြစ်၊ဘာဖြစ်ဖြစ် အဆင်ပြေသည်ဟုပြောလိုသည့်အခါတွင်အသုံးပြုသည်။အမေးပုံစံများ၏အဆုံးတွင်ဗျည်းနှင့်ဆုံးလျှင်이든지၊သရနှင့်ဆုံးလျှင်든지နှ့င်တွဲဆက်ရသည်။",
        "examples": "필요하면 언제든지 말씀하세요.\n(You can always talk me if you need.)\n(လိုအပ်ရင် အချိန်မရွေးပြောပါနော်။)\n\n식당에 가면 뭐든지 잘 먹어요.\n(I like eating anything if I go to restaurant.)\n(စားသောက်ဆိုင်သွားရင် ဘာပဲဖြစ်ဖြစ်ကောင်းကောင်းစားပါတယ်။)\n이일을 누구든지 할 수 있어요.\n(Anyone can do this work.)\n(ဒီအလုပ်ကိုဘယ်သူမဆိုလုပ်နိုင်ပါတယ်။)"
    },
    {
        "title": "은/ㄴ 지",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+은/ㄴ 지)တစ်ခုခုလုပ်လာတာ../လုပ်ထားတာ\n\nIt is used with action verb when it's been a certain period of time that action has been done.\n\n동사와 붙이고 \"어떤 활동을 하는것은 한기간이나 되었다\"라고 의미한다.\n\nလှုပ်ရှားမှုတစ်ခုခုကိုလုပ်လာသည်မှာအချိန်အတိုင်းအတာတစ်ခုကြာသွားပြီဟုပြောလိုသည့်အခါတွင်အသုံးပြုသည်။လှုပ်ရှားမှုပြကြိယာ၏အဆုံးတွင်ဗျည်းနှင့်ဆုံးလျှင်은지၊သရနှင့်ဆုံးလျှင်ㄴ지နှင့်တွဲဆက်ရသည်။မြန်မာစကားတွင်\"ဒါကိုလုပ်လာတာ/ဒါလုပ်ထားတာဘယ်လောက်ကြာပြီ\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "저는 한국어를 공부한 지 2년이나 되었다.\n(I've been learning Korean for 2 years.)\n(ကျွန်မ ကိုရီယားဘာသာစကားလေ့လာနေတာ ၂နှစ်လောက်ရှိပါပြီ။)\n\n민호 씨가 대학을 졸업한 지 4년 됐습니다.\n(It's been 4 years since Minho graduated from the university.)(မင်ဟို ဘွဲ့ရတာ ၄နှစ်တောင်ရှိပြီ။)\n\n이모는 저녁에 아무것도 안 먹은지 1년이 됐어요.\n(It's been 1 year since aunt didn't eat anything in evening.)\n(ဒေါ်လေးက ညနေဘက် ဘာမှမစားတာ ၁နှစ်လောက်ရှိပြီ။)"
    },
    {
        "title": "으려고/려고",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ +(ဗျည်း)으려고/(သရ)려고)လုပ်ဖို့/လုပ်ရန်။\n\nIt is used with an action verb to show someone's purpose or intention.The performance in the second clause is made in order to do the main action in the first clause.\n\n동사와 붙이고 말하는 사람의 계획이나 목적을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးရည်ရွယ်ချက်ကိုဖော်ပြရာတွင်အသုံးပြုသည်။ရှေ့ဝါကျ၏ရည်ရွယ်ချက်ပြည့်မြောက်ရန်လုပ်ဆောင်ဖို့ရာနောက်ဝါကျတွင်လှုပ်ရှားမှုတစ်ခုခုလုပ်ရခြင်းဖြစ်ကြောင်းပြောလိုသည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားတွင်တစ်စုံတစ်ခုကိုလုပ်ဖို့ရာဒါကိုလုပ်ပါတယ်စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "비빔밥을 먹으려고 한집에 갔어요.\n(I went to Korean restaurant to eat Bibimbap.)\n(ကိုရီးယားထမင်းသုပ်စားဖို့ကိုရီးယားစားသောက်ဆိုင်ကိုသွားခဲ့ပါတယ်။)\n유학을 가려고 열심히 공부하고 있어요.\n(I am studying hard to go abroad.)\n(နိုင်ငံခြားပညာသင်သွားဖို့ရာ ကြိုးကြိုးစားစားစာလေ့လာနေပါတယ်။)"
    },
    {
        "title": "아하다/어하다/여하다",
        "explainations": "(ခံစားမှုပြကြိယာ+아/어/여 하다)\n\nIt is used with a descriptive verb indicating emotion and changes the descriptive verb to an action verb.It is used only with a third person subject.\n\n형용사와 붙이고 다른사람 느낌을 경청자에게 표현할때 사용한다.\n\nဂုဏ်ရည်ပြကြိယာနှင့်တွဲသုံးပြီးယင်းသို့သုံးလိုက်သောအခါတွင် ခံစားမှုပြကြိယာသည် လှုပ်ရှားမှုပြကြိယာအဖြစ်သို့ပြောင်းသွားသည်။တစ်စုံတစ်ယောက်၏အကြောင်းကိုနားထောင်သူအားပြောပြလိုသည့်အခါတွင်သာအသုံးပြုပါသည်။",
        "examples": "아버지는 거짓말하는 사람을 싫어합니다.\n(Father doesn't like someone who lies.)\n(ဖေဖေက လိမ်ပြောတဲ့သူတွေကိုမကြိုက်ဘူး။)\n\n우리딸은 SNS에서 유명한 사람들을 부러워해요.\n(My daughter likes people who are popular in SNS.)\n(ကျွန်မတို့သမီးက ဖေ့စ်ဘုတ်ကဆယ်လီတွေကိုသိပ်အားကျတာ။)\n\n진산미 씨는 한국으로 가고 싶어합니다.\n(Jin San Mi wants to go to Korea.)\n(ဂျင်ဆန်းမီလေ ကိုရီးယားကိုသွားချင်နေတယ်။)"
    },
    {
        "title": "겠군요",
        "explainations": "(ကြိယာ+겠군요)မှာပဲနော်။\n\nIt is used with a verb to predict someone's feelings or a situation through hearing a story.\n\n동사와 붙이고 어떤 상황에 대해서 추측하는 것에 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးအကြောင်းအရာတစ်ခုကိုနားထောင်၍ ယင်းအကြောင်းအရာနှင့်ပတ်သတ်သည့်ခံစားချက်၊အခြေအနေတို့ကိုခန့်မှန်းပြောလိုသည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"တစ်ခုခုဖြစ်လာမှာပဲနော်၊ပျော်ဖို့ကောင်းမှာပဲနော်\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "가:아직 점심을 못 먹었어요.\n\t(I haven't had lunch yet.)\n\t(အခုထိနေ့လည်စာမစားရသေးဘူး။)\n나:배가 고프겠군요.\n\t(You should be hungry.)\n\t(ဗိုက်ဆာနေမှာပဲနော်။)\n\n가:에제 가족과 양곤 동물원에 갔어요.\n\t(I went to the Yangon zoo with my family yesterday.)\n\t(မနေ့က မိသားစုနဲ့ရန်ကုန်တိရစ္ဆာန်ဥယဥ်သွားခဲ့တယ်။)\n나:재미있었겠군요.\n\t(It must have been interesting.)\n\t(ပျော်ဖို့ကောင်းမှာပဲနော်။)"
    },
    {
        "title": "아야/어야/여야 하다 (or) 아야/어야/여야 되다",
        "explainations": "(ကြိယာ+아/어/여 야 하다(or)되다)လုပ်ကိုလုပ်ရမယ်။\n\nIt is used with a verb to emphasize the needs or duties.\n\n동사와 붙이고 책임이나 필요를 강조할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးကိစ္စတစ်ခုခုကိုတာဝန်အရ၊လိုအပ်ချက်အရမဖြစ်မနေလုပ်ရမယ်၊လုပ်မှဖြစ်မယ်ဟုပြောလိုသည့်အခါတွင်အသုံးပြုသည်။",
        "examples": "코로나 상황이 심해져서 밖에 나가면 마스크를 꼭 챙겨야 해요./챙겨야 되요.\n(You must wear mask if you go to outside as corona causes become worse.)\n(ကိုရိုနာအခြေအနေကပြင်းထန်လာလို့အပြင်ထွက်ရင် မဖြစ်မနေ နှာခေါင်းစည်းတပ်ရမယ်။)\n\n이 숙제를 오늘 안으로 끝내야 해요./끄내야 되요.\n(You must finish this homework today.)\n(ဒီအိမ်စာကိုဒီနေ့အပြီးလုပ်မှရမယ်။)"
    },
    {
        "title": "은/ㄴ 적이 있다/없다",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+(ဗျည်း)은/(သရ)ㄴ 적이 있다/없다)လုပ်ဖူးတယ်၊မလုပ်ဖူးဘူး။\n\nIt is used with an action verb to show a past experience.\n\n동사와 붙이고 과거에 경험했던 것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးယင်းလှုပ်ရှားမှုနှင့်ပတ်သတ်၍လုပ်ဖူးတယ်၊မလုပ်ဖူးဘူး ဟူ၍အတွေ့အကြုံကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်သွားဖူးတယ်၊လာဖူးတယ်၊စားဖူးတယ် စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "저는 한국으로 간 적이 있습니다.\n(I have ever been to Korea.)\n(ကျွန်တော်ကိုရီးယားသွားဖူးတယ်။)\n\n제 친구는 한복을 입은 적이 없습니다.\n(My friend has never worn Hanbok before.)\n(ကျွန်မသူငယ်ချင်းက ကိုးရီးယားရိုးရာဝတ်စုံ မဝတ်ဖူးဘူး။)"
    },
    {
        "title": "부터",
        "explainations": "(နာမ်+부터)_မှစလို့/ကစလို့။\n\nIt is used with a noun to express that the act should be done first before other acts.\n\n명사와 붙이고 처음으로 해야할 것을 표현할때 사용한다.\n\nနာမ်နှင့်တွဲသုံးပြီးစတင်ဖြစ်ပေါ်မည့်အရာ၊စတင်လုပ်ဆောင်မည့်အရာကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါကစလို့၊ဒါကအရင် လုပ်ပါမယ်\"စသည်ဖြင့် အဓိပ္ပာယ်ရသည်။",
        "examples": "학교에 오면 식당에서 식사부터 해요.\n(I eat first in canteen when I arrive to school.)\n(ကျောင်းလာရင် ကန်တင်းမှာမုန့်အရင်စားပါတယ်။)\n\n방청소부터 할까요?\n(Should I clean the room first?)\n(အခန်းအရင်စရှင်းရမလား။)\n\n방학을 하면  여행부터 하고 싶어요.\n(I want to travel first when school is closed.)\n(ကျောင်းပိတ်ရင် ခရီးအရင်သွားချင်တယ်။)"
    },
    {
        "title": "게",
        "explainations": "(ကြိယာ+게)\n\nIt is used with a verb to emphasize the following verb in detail.\n\n동사와 붙이고 그 동사를 강조하고 자세히 표현할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးယင်းကြိယာကိုအလေးအနက်ထား အတိအကျပြောလိုသည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားအနေဖြင့် မူတွဲဆက်သောကြိယာကိုလိုက်၍ဆီလျော်အောင်အဓိပ္ပာယ်ယူရပါမည်။",
        "examples": "미선이 머리를 짧게 잘랐어요.\n(Mi Saw cuts her hair shortly.)\n(မီစောက ဆံပင်ကို တိုတိုလေးညှပ်ထားတယ်။)\n\n잘 보이게 사진을 벽에 걸까요?\n(Should I hang the picture on the wall to see it well.)\n(သေချာမြင်ရအောင်ဓာတ်ပုံကိုနံရံမှာချိတ်ရမလား။)\n\n우리집에서 편안하게 쉴 수 있어요.\n(You can rest comfortably in our house.)\n(ကျွန်တော်တို့အိမ်မှာအေးအေးဆေးဆေးနားလို့ရပါတယ်။)"
    },
    {
        "title": "아도/어도/여도 되다",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+아/어/여 도 되다)(လုပ်လို့ရတယ်၊လုပ်ရင်ဖြစ်တယ်။)\n\nIt is used with an action verb to give permission to do something.\n\n동사와 붙이고 어떤 활동을 하려고 허락을 받은것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးယင်းလှုပ်ရှားမှုကိုလုပ်ဆောင်ရန်ခွင့်ပြုသည့်သဘောကိုဖော်ပြရာတွင်အသုံးပြုသည်။အမေးပုံစံသုံးလိုလျှင် 아/어/여 도 돼요?နှင့်တွဲဆက်အသုံးပြုပါသည်။",
        "examples": "이제 먹어도 됩니다.\n(You can eat now.)\n(အခုစားလို့ရပါပြီ။)\n\n여기에 앉아도 됩니다.\n(You can sit here.)\n(ဒီမှာထိုင်လို့ရပါတယ်။)\n\n여기에서 담배를 피워도 돼요?\n(May I smoke here?)\n(ဒီမှနေရာမှာဆေးလိပ်သောက်လို့ရမလား။)"
    },
    {
        "title": "으면/면 안되다",
        "explainations": "(ကြိယာ+(ဗျည်း)으면/(သရ)\n\n면 안되다)လုပ်လို့မရဘူး၊လုပ်ရင်မဖြစ်ဘူး။\n\nIt is used with a verb to prohibit or restrict the permission.\n\n동사와 붙이고 어떤 활동을 하는것을 허락 안할때, 금할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးယင်းကြိယာကိုတားမြစ်သည့်သဘော၊ ခွင့်မပြုသည့်သဘော၊ကန့်သတ်သည့်သဘောကိုဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "내일은 늦으면 안 돼요.\n(You can't be late tomorrow.)\n(မနက်ဖြန်တော့နောက်ကျလို့မရဘူး။)\n\n길 옆에 주차하면 안 됩니다.\n(You shouldn't park your car next to the road.)\n(လမ်းမဘေးမှာကားရပ်လို့မရပါဘူး။)"
    },
    {
        "title": "기는 하지만",
        "explainations": "(ကြိယာ+기는 하지만)ဒါတော့ဟုတ်ပေမယ့်၊ဒါတော့ဖြစ်ပေမယ့်။\n\nIt is used with a verb to prove the statement in the first clause but it describes the opposite statement in the second clause.\n\n동사와 붙이고 앞 문장을 인정했는데 뒷 문장은 앞와 굉장히 다르다는 것을 표현할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးအကောင်းအဆိုးတွဲနေသောအကြောင်းအရာတစ်ခုတွင်ရှေ့ဝါကျရှိအ​ခြေအနေကိုသက်သေပြုပေးသော်လည်း နောက်ဝါကျတွင်မူရှေ့နှင့်ဆန့်ကျင်ဘက်အခြေအနေတစ်ခုဖြစ်သည်ဟုပြောလိုသည့်အခါတွင် အသုံးပြုပါသည်။မြန်မာစကားတွင်\"ဒါကောင်းတာတော့ဟုတ်ပေမယ့် ဒါကျတော့မကောင်းဘူး\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "이 식당은 음식이 좋기는 하지만 값이 너무 비싸요.\n(This restaurant has good food but it is too expensive.)\n(ဒီစားသောက်ဆိုင်က အစားအသောက်ကောင်းပေမယ့် စျေးတော့တော်တော်ကြီးတယ်။)\n\n한국어 공부하기가 재미있기는 하지만 어려워요.\n(Learning Korean is fun but it is hard.)\n(ကိုရီးယားဘာသာစကားလေ့လာရတာစိတ်ဝင်စားဖို့တော့ကောင်းပါရဲ့ဒါမဲ့ခက်တယ်။)\n\n우리 동네는 교통이 편하기는 하지만 좀 시끄러워요.\n(Transpotation of our quarter is convenient but quite noisy.)\n(ကျွန်တော်တို့ရပ်ကွက်ကသွားရေးလာရေးအဆင်ပြေပေမယ့်နဲနဲတော့ဆူတယ်။)"
    },
    {
        "title": "을까/ㄹ까 하다",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+(ဗျည်း)을까/(သရ)ㄹ까 하다)လုပ်မလို့စဥ်းစားထားတယ်။\n\nIt is used with an action verb and shows an intention or plan of the speaker.It means that a speaker's intention or plan is uncertain and is still under consideration.\n\n동사와 붙이고 \"어떤 활동을 하려고 생각중이다\"라고 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးယင်းလှုပ်ရှားမှုကိုပြုလုပ်ရန်ကြံရွယ်ထားသည်ဟုပြောလိုသည့်အခါတွင်အသုံးပြုသည်။လုပ်ဆောင်ရန်သေချာမဆုံးဖြတ်ရသေးဘဲစဥ်းစားနေသည့်အခြေအနေကိုဖော်ပြသည်။\nမြန်မာစကားတွင်\"လုပ်ရင်ကောင်းမလားလို့စဥ်းစားနေတာ\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "방학에 가족을 보려고 고향으로 갈까 해요.\n(I am thinking of going to my nativetown in vacation to see my family.)\n(ပိတ်ရက်မှာ မိသားစုနဲ့တွေ့ဖို့မွေးရပ်မြေကိုပြန်ရင်ကောင်းမလားလို့။)\n온라인 수업을 연결할까 하는데 어느 학원이 좋아요?\n(I am thinking of joining online class.Do you know any good institutes?)\n(အွန်လိုင်းသင်တန်းတတ်ရင်ကောင်းမလားလို့စဥ်းစားနေတာ..ဘယ်သင်တန်းတွေကောင်းလဲဟင်။)\n요즘 입맛이 없어서 맛집에 가서 맛있는 것을 먹을까 해요.\n(I am thinking of eating delicious food in restaurant because I am annoying food in home.)\n(ခုတစ်လောပါးစပ်ပျက်နေလို့တစ်ဆိုင်ဆိုင်သွားပြီးအရသာရှိတာလေးများစားရကောင်းမလားလို့။)"
    },
    {
        "title": "으로/로 하다",
        "explainations": "(နာမ်+(ဗျည်း)으로/(သရ)로 하다 )နဲ့၊ဖြင့်၊သို့၊အနေနဲ့..လုပ်တယ်။\n\nIt is used with a noun and has a meaning of your choice.\n\n명사와 붙이고 어떤 선택을 결정할때 사용한다.\n\nနာမ်နှင့်တွဲသုံးပြီးရွေးချယ်မှုတစ်ခုကိုဆုံးဖြတ်သည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါလေးလုပ်လိုက်တယ်၊ဒီလိုလေးလုပ်လိုက်တယ်\"စသည်ဖြင့် ဆီလျော်အောင်အဓိပ္ပာယ်ယူရပါမည်။",
        "examples": " 가:뭘 드시겠어요?\n(What would you like to drink?)\n(ဘာများသုံးဆောင်ပါမလဲခင်ဗျာ။)\n\n나:저는 커피로 하겠습니다.\n(I'd like to drink coffee.)\n(ကျွန်တော်ကတော့ ကော်ဖီသောက်ပါမယ်။)\n\n가:선물은 케이크로 하는 게 어때요?\n(What about a cake as a present?)\n(လက်ဆောင်ကို ကိတ်မုန့်လေးပေးရင် ဘယ်လိုလဲ။)\n나:그 생각이 좋아요.\n(That's a good idea.)\n(အဲ့အကြံလေးကောင်းတယ်။)"
    },
    {
        "title": "아도/어도/여도",
        "explainations": "(ကြိယာ+아/어/여 도)တောင်မှ/လည်းပဲ။\n\nIt is used with a verb to describe that the result from the first clause wouldn't affect the second clause.\n\n동사와 붙이고 \"앞 문장의 결과는 뒷 문장을 위해 아무 영향이 없다\" 라고 표현할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးရှေ့ဝါကျတွင်ဖြစ်သောအကြောင်းအရာသည်နောက်ဝါကျကိုသက်ရောက်မှုမရှိပါဟုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါလုပ်တာတောင်မှဒါမဖြစ်ဘူး၊ဒါဖြစ်လည်းပဲဒါတော့မဖြစ်ဘူး\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "공기가 없어도 살 수 있습니까?\n(Can we live even without any oxygen.)\n(လေမရှိရင်တောင်အသက်ရှင်နိုင်ပါသလား။)\n\n비가 와도 여행을 갑니다.\n(I go to trip even it rains.)\n(မိုးရွာနေလည်းခရီးကတော့သွားပါတယ်။)"
    },
    {
        "title": "으니까/니까",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+(ဗျည်း)으니까/(သရ)니까)လုပ်လိုက်တော့၊လုပ်တဲ့အခါ။\n\nIt is used with an action verb to express that the statement of the second clause is discovered or sured when that action in the first clause has happened.\n\n동사와 붙이고 앞 문장의 활동을 해봐야 뒷 문장의 상황을 알게 되는 것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီး ရှေ့ဝါကျတွင်ယင်းလှုပ်ရှားမှုကိုပြုလုပ်လိုက်သည့်အခါမှနောက်ဝါကျတွင်အကြောင်းအရာတစ်ခုသေချာသွားကြောင်း၊တွေ့ရှိသွားကြောင်းဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "일기예보를 보니까 내일 비가 올 것을 알게 됬어요.\n(When I watched weather report,I've known that it will rain tomorrow.)\n(မိုးလေဝသသတင်းနားထောင်တော့မှမနက်ဖြန်မိုးရွာမယ်ဆိုတာသိတော့တယ်။)\n\n교실에 들어가니까 아무도 없었어요.\n(When I came in the class,there was nobody.)\n(စာသင်ခန်းထဲဝင်သွားတော့ဘယ်သူမှမရှိဘူး။)\n\n비빔밥을 먹어 보니까 엄첨 맛있어요.\n(When I ate Bibimbap,it was very delicious.)\n(ကိုရီးယားထမင်းသုပ်ကို စားကြည့်လိုက်မှတော်တော်အရသာရှိတာပဲ။)"
    },
    {
        "title": "았으면/었으면/였으면 좋겠다",
        "explainations": "(ကြိယာ+았/었/였으면 좋겠다) ခဲ့ရင်ကောင်းမယ်။\n\nIt is used with a verb to express the speaker's desire or hopes.\n\n동사와 붙이고 말하는 사람의 희망이나 요구를 표현할때 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီး ပြောဆိုသူ၏ဆန္ဒ၊မျှော်လင့်ချက်တို့ကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်အဲ့ဒီလိုဖြစ်ရင်ကောင်းမယ်၊အဲ့လိုသာဆိုကောင်းမှာပဲ စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "오늘 비가 왔으면 좋겠어요.\n(I hope it  rains today)\n(ဒီနေ့မိုးရွာရင်ကောင်းမယ်။)\n\n말하기 대회에 상을 받았으면 좋겠어요.\n(I wish I got the first prize in speaking contest.)\n(စကားပြောပြိုင်ပွဲမှာဆုရခဲ့ရင်ကောင်းမှာပဲ။)"
    },
    {
        "title": "을지/ㄹ지 _을지/ㄹ지",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+을지/ㄹ지 _을지/ㄹ지)လုပ်ရမလား..လုပ်ရမလား။\n\nIt is used with an action verb to express that the speaker is still considering what to select between two actions.\n\n동사와 붙이고 두 활동중에 무엇을 해야할지 생각하는 것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီး လှုပ်ရှားမှုနှစ်ခုတွင်မည်သည်ကိုလုပ်ဆောင်ရမည်ကိုစဥ်းစားနေသည့်ပုံစံကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါလုပ်ရမလား၊ဟိုဟာလုပ်ရမလား\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "여행으로 중국으로 갈지 한국으로 갈지 이야기해 봅시다.\n(Let's talk about whether we should go to china or south korea as a trip.)\n(ခရီးကို တရုတ်ပြည်သွားရကောင်းမလား ကိုရီယားသွားရကောင်းမလား တိုင်ပင်ရအောင်။)\n\n음식을 직접 만들지 식당에서 주문할지 생각 중이에요.\n(I'm thinking whether we are going to cook ourselves or deliver from restaurant.\n(မုန့်ကိုကိုယ်တိုင်လုပ်ရင်ကောင်းမလား ဆိုင်ကမှာရင်ကောင်းမလားစဥ်းစားနေတုန်းပါ။)"
    },
    {
        "title": "기로 하다",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+기로 하다)_လုပ်ဖို့ဆုံးဖြတ်လိုက်တယ်။\n\nIt is used with an action verb to express that a decision has been made to do that action.Generally it is used in the decision that many people discussed it together.\n\n동사와 붙이고 어떤 활동을 하려고 결정하는 것에 사용한다.\n\nလှုပ်ရှားမှုပြကြိဟာနှင့်တွဲသုံးပြီးယင်းလှုပ်ရှားမှုကိုပြုလုပ်ရန်ဆုံးဖြတ်လိုက်ကြောင်းပြောလိုသည့်အခါတွင်အသုံးပြုသည်။များသောအားဖြင့်လူအများဝိုင်းဝန်းဆွေးနွေးပြီးဆုံးဖြတ်ချက်ချလိုက်သည့်အခါမျိုးတွင်သုံးပါသည်။",
        "examples": "이번 회의에는 새로운 상품을 판매하기로 했어요.\n(We decided to sell the new goods in this meeting.)\n(ဒီတစ်ခေါက်အစည်းအဝေးမှာကုန်ပစ္စည်းသစ်တွေရောင်းချဖို့ ဆုံးဖြတ်ခဲ့ကြတယ်။)\n\n발표를 위해서 내일에 디시 의논하기로 합시다.\n(Let's discuss it again for the presentation tomorrow.)\n(Presentationအတွက်မနက်ဖြန်ထပ်ပြီးဆွေးနွေးဖို့လုပ်ကြတာပေါ့။)\n\n올해에 언니와 같이 온라인 쇼핑을 시작하기로 했다.\n(I decided to start online shopping with my sister in this year.)\n(ဒီနှစ်မှာ အစ်မနဲ့တူတူ online shopping စလုပ်ဖို့လုပ်ခဲ့တယ်။)"
    },
    {
        "title": "는지 알다/모르다,은/ㄴ지 알다/모르다",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+는지 알다/모르다, ဂုဏ်ရည်ပြကြိယာ+은/ㄴ지 알다/모르다)ဆိုတာသိတယ်/မသိဘူး။\n\nIt is used with a verb to express whether the speaker knows a certain fact or not.It is also used in question form.\n\n동사와 붙이고 상황에 대해서 잘 아는것, 아니면 알지 않는 것을 말할때 사용한다.\n\nကြိဟာနှင့်တွဲသုံးပြီးပြောဆိုသူသည်အကြောင်းတစ်စုံတစ်ရာနှင့်ပတ်သတ်၍သေချာသိခြင်း၊မသိခြင်းကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါဖြစ်တယ်ဆိုတာသိပါတယ်၊ဒါဖြစ်လားဆိုတာမသိပါဘူး\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။အမေးပုံစံဖြင့်လည်းသုံးနိုင်သည်။",
        "examples": "회의는 몇 시에 끝나는지 알아요.2시에 끝나요.\n(I know when the meeting finishes.It finishes in 2pm.)\n(အစည်းအဝေးကဘယ်နှစ်နာရီမှာပြီးလဲဆိုတာသိပါတယ်။နေ့လည်နှစ်နာရီမှာပြီးပါတယ်။)\n\n이버스는 어디로 가는지 몰라요.\n(I don't know where this bus goes.)\n(ဒီဘတ်စ်ကားဘယ်ကိုသွားလဲဆိုတာမသိပါဘူး။)\n\n우리 친구 중에서 누가 제일 나이가 많은지 알아요?\n(Do you known who is the oldest person in my friends.)\n(ငါ့သူငယ်ချင်းတွေထဲမှာဘယ်သူကအသက်အကြီးဆုံးလဲသိလား။)"
    },
    {
        "title": "으로/로",
        "explainations": "(နာမ်+(ဗျည်း)으로(သရ)/로)နဲ့၊ဖြင့်၊သို့၊အနေနဲ့။\n\nIt is used with a noun to express the selection of an exchanging object.It comes before action verbs such as 갈아타다,갈아입다,바꾸다.\n\n명사와 붙이고 바꿔서 해야할 것을 선택할때 사용한다.\n\nနာမ်နှင့်တွဲသုံးပြီးပြောင်းလဲလုပ်ဆောင်ရမည့်အရာတစ်ခုအားရွေးချယ်ခြင်းကိုဖော်ပြရာတွင်အသုံးပြုသည်။으로/로၏နောက်တွင်갈아타다,갈아입다,꾸다စသည့်လှုပ်ရှားမှုပြကြိယာများလိုက်ပါသည်။မြန်မာစကားတွင်\"ဒါနဲလဲလိုက်တာ၊ဒါပြောင်းလိုက်တာ\"စသည်ဖြင့်အဓိပ္ပာယ်ရပါသည်။",
        "examples": "Bogyoke시장에서 37번 버스로 갈아타세요.\n(Change to bus number 37 at Bogyoke market.)\n(ဗိုလ်ချုပ်စျေးမှာ ၃၇ဘတ်စ်ကားကိုပြောင်းစီးပါ။)\n\n운동하려고 운동복으로 갈아입었어요.\n(I changed sportswear to do sport.)\n(အားကစားလုပ်ဖို့အားကစားဝတ်စုံကို​လဲဝတ်ခဲ့တယ်။)\n\n미국 달러를 한국 원으로 바꿔주세요.\n(Please exchange American dollar to Korea Wan.)\n(အမေရိကန်ဒေါ်လာကိုကိုရီးယားဝမ်နဲ့လဲပေးပါ။)"
    },
    {
        "title": "으려면/려면",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+(ဗျည်း)으려면/(သရ)려면)ချင်ရင်။\n\nIt is used with an action verb to show a conditional desire like 'if you want to do something'.\n\n동사와 붙이고 소망이 완성되기위해 해야할 것에대한 말할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးအလိုဆန္ဒများပြည့်ဝရန်လုပ်ဆောင်ရမည့်အရာများကိုပြောလိုသည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ဒါဖြစ်ချင်ရင်ဒါလုပ်ရမယ်\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "유학을 가려면 열심히 공부해야 합니다.\n(If you want to study in abroad,you have to study hard.)\n(နိုင်ငံခြားပညာတော်သင်သွားချင်ရင်စာကြိုးစားရမယ်။)\n\n무대 앞에 앉으려면 일찍 오세요.\n(If you want to sit in front of stage,come early.)\n(စင်ရှေ့နားမှာထိုင်ချင်ရင်စောစောလာပါ။)"
    },
    {
        "title": "이나/나",
        "explainations": "[နာမ်+(ဗျည်း)이나/(သရ)나] တောင်မှလား။ အာမေဋိတ်အသုံးအနှုန်း။\n\nIt is used with a noun to express the speaker's feeling that the quantity is large.\n\n명사와 붙이고 생각보다 양이 많은 것을 놀랄때 사용한다.\n\nနာမ်နှင့်တွဲသုံးပြီးပမာဏများပြားသည်ကိုအံ့အားသင့်နေသည့်​ပြောဆိုသူ၏ခံစားချက်ကိုဖော်ပြရာတွင်သုံးသောဝါကျအဆုံးသတ်ဖြစ်သည်။မြန်မာစကားတွင်\"အဲ့ဒီ့လောက်တောင်မှလား\"စသည်ဖြင့်အဓိပ္ပာယ်ရသည်။",
        "examples": "가:언니는 한달에 책을 여섯 권 읽어요.\n(My sister reads six books in one month.)\n(အစ်မက တစ်လကို စာအုပ်၆အုပ်ဖတ်တယ်။)\n나:여섯 권이나요.\n(Six books(that much)?)\n(ခြောက်အုပ်တောင်။)\n\n가:제 이모의 집에서 고양이 여덟 마리가 있어요.\n(Eight cats have in my aunt's house.)\n(ကျွန်မအဒေါ်အိမ်မှာ ကြောင်၈ကောင်ရှိတယ်။)\n나:여덟 마리나요.\n(Eight (that much)?)\n(ရှစ်ကောင်တောင်။)"
    },
    {
        "title": "어 보이다",
        "explainations": "(သရုပ်ဖော်ပြကြိယာ+어 보이다)ပုံပေါ်တယ်။\n\nIt is used with a descriptive verb to show that the speaker guesses by looking at the outside view.\n\n형용사와 붙이고 어떤 상황의 외부를 보고 추측할때 사용한다.\n\nသရုပ်ဖော်ပြကြိယာနှင့်တွဲသုံးပြီးအခြေအနေတစ်ခု၏အပြင်ပန်းပုံစံကိုကြည့်ပြီးခန့်မှန်းပြောဆိုသည့်အခါတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"တော်တော်ကောင်းမယ့်ပုံပဲ၊ဖြစ်မယ့်ပုံပဲ၊ဖြစ်ပုံပေါ်တယ်\"စသည်ဖြင့် အဓိပ္ပာယ်ရသည်။",
        "examples": "이 음식은 맛있어 보여요.\n(This food looks good.)\n(ဒီမုန့်ကအရသာရှိမယ့်ပုံပဲ။)\n\n새로운 선생님이 친절해 보여요.\n(Our new teacher looks good- hearted.)\n(ကျွန်မတို့ဆရာမအသစ်ကသဘောကောင်းမယ့်ပုံပါပဲ။)"
    },
    {
        "title": "아/어/여, 이야/야",
        "explainations": "(ကြိယာ+아/어/여), (နာမ်+이야/야)ရင်းနှီးမှုအသုံးအနှုန်း။\n\nIt is the intimate style of a speed mood.In this form, the final ending \"요\" can be deleted when we talk to someone who is of equal or lower status.\n\n친한 사람들과 말하는 방식이다.\n\nရင်းနှီးသူများကိုပြောသောစကားပြောပုံစံကိုဖော်ပြသည့်ဝါကျအဆုံးသတ်ဖြစ်သည်။မိမိနှင့်ရွယ်တူ(သို့)ငယ်သူများနှင့်ရင်းရင်းနှီးနှီးပြောလိုသည့်အခါ ဝါကျအဆုံးတွင် \"요\"ကိုဖြုတ်ပြီးပြောသည့်ပုံစံဖြစ်သည်။",
        "examples": "에제 친구를 만났어.\n(I met my friend yesterday.)\n(မနေ့ကသူငယ်ချင်းကိုတွေ့ခဲ့တယ်။)\n\n시간이 없어서 빨리 해.\n(Hurry up! we have no time.)\n(အချိန်မရှိဘူး၊မြန်မြန်လုပ်။)\n\n그분이 제 친구야.\n(That person is my friend.)\n(အဲ့လူက ကျွန်တော့သူငယ်ချင်းလေ။)"
    },
    {
        "title": "지 마",
        "explainations": "(ကြိယာ+지 마)မလုပ်နဲ့။ (ရင်းနှီးမှုအသုံးအနှုန်း)\n\nThe intimate style of the negative honorific imperative form''지 마세요''  is \"_지 마\" which is the form that the honorific form \"_시\"and \"요\"are deleted.\n\n친한 사람들에게 어떤 상황에 대해서 명령하고 싶을때 사용한다.\n\nရင်းနှီးသူများကိုပြောသောတားမြစ်သည့်သဘောကိုဖော်ပြသည့်စကားပြောပုံစံဖြစ်သည်။ရင်းနှီးသူများကို\"မလုပ်နဲ့၊မသွားနဲ့၊မစားနဲ့\"စသည်ဖြင့်တားမြစ်လိုသည့်အခါ ယဥ်ကျေးစွာတားမြစ်သည့်ပုံစံ지 마세요တွင် 세요 ကိုဖြုတ်ပြီးကြိယာရင်းမြစ်တွင်지 마ကိုတွဲဆက်၍အသုံးပြုနိုင်သည်။",
        "examples": "밤 늦게 까지 스마트 폰을 사용하지 마.\n(Don't use smart phone too late at night.)\n(ညနက်တဲ့ထိဖုန်းမသုံးနဲ့။)\n기름이 많은 음식을 많이 먹지 마.\n(Don't eat too much oily food.)\n(ဆီများတဲ့အစာတွေသိပ်မစားပါနဲ့။)"
    },
    {
        "title": "자",
        "explainations": "(ကြိယာ+자)ကြစို့/ကြရအောင်။(ရင်းနှီးမှုအသုံးအနှုန်း)\n\nThe intimate style of the formal honorific final-ending in a propositive sentence\"_읍시다/ㅂ시다\" is \"_자\".\n\n친한 사람들에게 어떤 상황에 대한 이론하고 싶을때 사용한다.\n\nရင်းနှီးသူများကိုပြောသောညှိုနှိုင်းသည့်သဘောကိုဖော်ပြသည့်စကားပြောပုံစံဖြစ်သည်။ရင်းနှီးသူများကို သွားကြစို့၊စားကြစို့ စသည်ဖြင့်​ညှိုနှိုင်းလိုသည့်အခါ ယဥ်ကျေးသောအသုံးအနှုန်း읍시다/ㅂ시다အစား ကြိယာရင်းမြစ်တွင်자ကိုတွဲဆက်၍အသုံးပြုနိုင်သည်။",
        "examples": "끝까지 열심히 하자.\n(Let's do hard to the end.)\n(အဆုံးထိကြိုးကြိုးစားစားလုပ်ကြစို့။)\n\n밥 먹으러 가자.\n(Let's go to eat.)\n(ထမင်းစားဖို့သွားရအောင်။)"
    },
    {
        "title": "이나/나",
        "explainations": "(နာမ်+이나/나)ဖြစ်ဖြစ်၊ဖြစ်စေ။\n\n①It is used with only one noun to express that the speaker choose this  noun as it doesn't have the other best option.\n\n명사와 붙이고 다른 선택이 없고 그 명사 하나만 선택할때 사용한다.\n\nနာမ်တစ်ခုတည်းတွင်သာတွဲဆက်ပြီးပြောဆိုသူသည်အခြားရွေးချယ်စရာမရှိသည့်အခါ ယင်းနာမ်တစ်ခုတည်းကိုသာရွေးချယ်ပြီးပြုလုပ်သည်ကိုဖော်ပြရာတွင်အသုံးပြုသည်။\n\n\n②It is used between two nouns to express that the speaker choose one or the other.\n\n두 명사 사이에 사용하고 이것 아니면 다른것을 선택할 것이다고 표현할때 사용한다.\n\nနာမ်(၂)ခုကြားတွင်တွဲဆက်ပြီးတစ်ခုမဟုတ်တစ်ခုရွေးချယ်ကြောင်းဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "심심한데 노래나 같이 부를까요?\n(Shall we sing a song together since we are bored.)\n(ပျင်းနေလို့သီချင်းလေးဖြစ်ဖြစ်တူတူဆိုကြမလား။)\n\n별일 없으면 쇼핑이나 갑시다.\n(If you don't have any special things to do,let's go shopping.)\n(ကိစ္စအထွေအထူးမရှိရင်ရှောပင်လေးဖြစ်ဖြစ်သွားရအောင်။)\n\n\n 밖에 나가면 치킨이나 피자를 사와 주세요.\n(Please buy chicken or pizza if you go to outside.)\n(အပြင်သွားရင် ကြက်ကြော်ဖြစ်ဖြစ် ပီဇာ(ဖြစ်ဖြစ်)ဝယ်လာပေးပါ။)\n\n회의를 수요일이나 목요일에서 합시다.\n(Let's do meeting in wednesday or thursday.)\n(အစည်းအဝေးကိုဗုဒ္ဓဟူးနေ့ဖြစ်ဖြစ် ကြာသာပတေးနေ့(ဖြစ်ဖြစ်)လုပ်ရအောင်။)"
    },
    {
        "title": "는데, 은데/ㄴ데",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+는데, ဂုဏ်ရည်ပြကြိယာ+은데/ㄴ데)ပေမယ့်၊သော်လည်း။\n\n①It is used with a verb to make a comparison.In the second clause,question can be made by comparing with the point in the first clause.\n\n동사와 붙이고 앞 문장의 상황과 비교하고 뒷 문장에서 질문하는것에 사용한다.\n\nကြိယာနှင့်တွဲသုံးပြီးရှေ့ဝါကျတွင်ဖော်ပြသောအကြောင်းအရာနှင့်နှိုင်းယှဥ်ပြီးနောက်ဝါကျတွင်မေးမြန်းခြင်းကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင်\"ကျွန်တော်က မာလာရှမ်းကောကြိုက်တယ်၊ခင်ဗျားရောဘာကြိုက်လဲ။\"စသည့်အဓိပ္ပာယ်မျိုးဖြစ်သည်။\n\n\n② It is used to express the situation which the first clause is opposite to the second clause.\n\n앞 문장과 뒷 문장이 반대가 되는 상황에 사용한다.\n\nရှေ့ဝါကျနှင့်နောက်ဝါကျ ဆန့်ကျင်ဖက်ဖြစ်သည့်အခြေအနေကိုဖော်ပြရာတွင်အသုံးပြုသည်။\n\n\n③It is used to express the background which is applicable to the second clause.\n뒷 문장에 대한 배경을 표현할때 사용한다.\nနောက်ဝါကျနှင့်သက်ဆိုင်သည့်နောက်ခံအခြေအနေကိုဖော်ပြရာတွင်အသုံးပြုသည်။\n\n\n④It is used to express the general situation to introduce or explain something.The first clause shows the beginning of a situation to show the details in the second clause.\n\n어떤 것을 소개하거나 설명할때 사용한다.\n\nတစ်စုံတစ်ရာကိုမိတ်ဆက်ခြင်း၊ရှင်းပြခြင်းပြုလုပ်ရန်ယေဘုယျအခြေအနေကိုဖော်ပြရာတွင်အသုံးပြုသည်။နောက်ဝါကျတွင်အသေးစိတ်အကြောင်းအရာကိုဖော်ပြရန် ရှေ့ဝါကျတွင်အခြေအနေအစပျိုးမှုကိုဖော်ပြရာတွင်အသုံးပြုသည်။\n\n\n⑤It is used to express the reason which it creates the action in the second clause.\n\n뒷 문장의 상황을 발생하게 되는 이유를 표현할때 사용한다.\n\nနောက်စာကြောင်းတွင်ဖြစ်ပေါ်သောအခြေအနေ၊လှုပ်ရှားမှုကိုဖြစ်ပေါ်စေသောအကြောင်းရင်းကိုဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "저는 춤 추기를 좋아하는데 선미 씨는 뭘 좋아하세요.?\n(I like dancing; Which is your favorite,Saw Mi?)\n(ကျွန်တော်ကအကကတာကြိုက်တယ်၊ဆောမီရောဘာကြိုက်လဲ။)\n\n우리 딸이 일하는 회사가 월급이 많은데 미미 씨 회사는 어때요?\n(The company, my daughter works is good salary;how about your company,Mi Mi?)\n(ကျွန်မသမီးလုပ်တဲ့ကုမ္ပဏီက လစာကောင်းတယ်၊မီမီတို့ကုမ္ပဏီရောဘယ်လိုလဲ။)\n\n\n매일 매일 공부하고 있는데 실력이 늘어지지 않아요.\n(Although I'm studying hard, skill doesn't become improve.)\n(နေ့တိုင်းနေ့တိုင်းစာလုပ်နေပေမယ့် စွမ်းရည်ကမတိုးတက်လာဘူး။)\n\n아침마다 운동을 하는데 살이 빠지지 않아요.\n(Although I do exercise in every morning,weight doesn't lose.)\n(မနက်တိုင်းအားကစားလုပ်ပေမယ့်ဝိတ်ကမကျပါဘူး။)\n\n\n비가 오고 있는데 우산을 가져가세요.\n(Take umbrella because it is raining.)\n(မိုးရွာနေတာမို့ထီးယူသွားပါ။)\n\n경치가 아름다운데 사진을 찍고싶어요.\n(I want to take photograph as the scenery is beautiful.)\n(ရှုခင်းတွေလှလို့ဓာတ်ပုံရိုက်ချင်လိုက်တာ။)\n\n어제 노래를 부르고 싶은데 노래방에 갔어요.\n(I went to Karaoke yesterday because I want to sing.)\n(မနေ့က သီချင်းဆိုချင်လို့ ကာရာအိုကေသွားခဲ့တယ်။)\n\n\n산미는 우리 친구인데 머리가 좋고 아주 똑똑해요.\n(San Mi is my friend and she is intelligent and very clever.)\n(ဆန်းမီကငါတို့သူငယ်ချင်းလေ၊သူကဥာဏ်ကောင်းပြီးအရမ်းတော်တာ။)\n\n이 바지는 백화점에서 샀는데 튼튼하고 편해요.\n(This trouser was bought from supermarket and it is strong and comfortable.)\n(ဒီဘောင်းဘီက စူပါမားကတ်ကဝယ်ခဲ့တာလေ၊အကြမ်းခံပြီးတော့ဝတ်လို့ကောင်းတယ်။)\n\n\n할 일이 다 끝났는데 오늘 일직 퇴근하면 돼요.\n(Can I leave the office early today as I finished all my works.)\n(လုပ်စရာအလုပ်တွေအကုန်ပြီးပြီမို့ဒီနေ့ရုံးစောစောဆင်းလို့ရမလား။)\n\n심심한데 같이 음악이나 들을까요?\n(We are bored.Shall we listen to music together.)\n(ပျင်းလိုက်တာ။သီချင်းလေးဘာလေးတူတူနားထောင်ကြမလား။)"
    },
    {
        "title": "아지다/어지다/여지다",
        "explainations": "①(ဂုဏ်ရည်ပြကြိယာ+아/어/여 지다)ဖြစ်လာတယ်။\n\nIt is used with a descriptive verb and shows that a status of subject has changed.\n\n형용사와 붙이고 달라지는 상황을 표현할때 사용한다.\n\nဂုဏ်ရည်ပြကြိယာနှင့်တွဲသုံးပြီးပြောင်းလဲလာသောအခြေအနေကိုဖော်ပြရာတွင်အသုံးပြုသည်။\n\n\nလှုပ်ရှားမှုပြကြိယာ+아/어/여 지다)လုပ်ခြင်းခံရတယ်၊လုပ်ထားတယ်။\n\nIt is used with an action verb to show a passivity.\n\n동사와 붙이고 수동성을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးတစ်စုံတစ်ခု၏ပြုလုပ်ခြင်းခံရသည့်သဘောကိုဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "하루에 물을 많이 마셔서 피부가 좋아졌어요.\n(My skin became better as I drink water a lot in one day.)\n(တစ်နေ့ကိုရေအများကြီးသောက်လို့ အသားအရေလှလာတယ်။)\n\n두 사람이 일을 같이 하면서 친해졌어요.\n(Two of them became close working together.)\n(နှစ်ယောက်ကအလုပ်တူတူလုပ်ရင်းရင်းနှီးလာကြတယ်။)\n\n\n꽃다발이 아주 예쁘게 만들어졌어요.\n(This bouquet was made beautifully.)\n(ဒီပန်းစည်ကိုလှလှလေးလုပ်ထားတယ်။)\n\n바간(Bagan)은 세계에 잘 알려진 관광지 입니다.\n(Bagan is a well-known tourist spot around the world.)\n(ပုဂံဟာကမ္ဘာကသိတဲ့ခရီးသွားနေရာတစ်ခုဖြစ်တယ်။)"
    },
    {
        "title": "아/어/여 보다",
        "explainations": "①(လှုပ်ရှားမှုပြကြိယာ+아/어/여 보다)လုပ်ကြည့်ခဲ့တယ်။မလုပ်ကြည့်ခဲ့ဘူး။\n\nIt is used with an action verb to express someone's experience,it is used with the past tense.\n\n동사와 붙이고 어떤것에 대한 경험을 말할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးတစ်စုံတစ်ခုကိုလုပ်ကြည့်ဖူးခြင်း၊မလုပ်ကြည့်ဖူးခြင်းစသည့်အတွေ့အကြုံများကိုဖော်ပြရာတွင်အသုံးပြုသည်။အတိတ်ကာလပြဝါကျများတွင်သုံးသည်။",
        "examples": "저는 문화 교환 행사에서 한복을 입어 봤어요.\n(I have worn Hanbok in culture exchange festival.)\n(ယဥ်ကျေးမှုဖလှယ်ပွဲမှာကိုရီးယားရိုးရာဝတ်စုံဝတ်ကြည့်ဖူးတယ်။)\n\n한국에 가면서도 제주도에 가보지 않았어요.\n(I haven't been to Jae Ju island although I go to Korea.)\n(ကိုရီးယားသွားတာတောင်ဂျယ်ဂျူကျွန်းကိုမသွားကြည့်ခဲ့ရဘူး။)\n\n\n이 코팅이 정말 편해서 한번 입어보세요.(Please try this coat,this is really comfortable.)(ဒီကုတ်အင်္ကျီကဝတ်လို့အရမ်းကောင်းလို့တစ်ခါလောက်ဝတ်ကြည့်ပါ။)\n\n미국으로 한번 가보고 싶어요.\n(I would like to go to Europe once.)\n(အမေရိကားကိုတစ်ခေါက်လောက်သွားချင်တယ်။"
    },
    {
        "title": "Intimate style - 는다/ㄴ다/다,_니?,_아라/어라/여라",
        "explainations": "습니다/ㅂ니다=_는다/ㄴ다/다\n습니까/ㅂ니까?=_니?\n으십시오/십시오=아라/어라/여라\n\nIt is the intimate style of a speed used to someone who is equal or lower status.The intimate style of the formal honorific final-ending in a declarative sentence 습니다/ㅂ니다 is 는/ㄴ다, 다.The intimate style of the final ending in an interrogative sentence 습니까/ㅂ니까?is 니?The intimate style of the imperative final ending읍시시오/십시오  is 아라/어라/여라.\n\n친한 사람들과 말하는 방식이다.\n\nမိမိနှင့်ရွယ်တူ(သို့)ငယ်သူများကိုပြောဆိုသည့်ရင်းနှီးမှုပုံစံဝါကျအဆုံးသတ်များဖြစ်သည်။ယဥ်ကျေးသည့်ဝါကျအဆုံးသတ်습니다/ㅂ니다အစား는/ㄴ다, 다၊အမေးဝါကျအဆုံးသတ်습니까/ㅂ니까?အစား니?၊အမိန့်ပေးဝါကျအဆုံးသတ်읍시시오/십시오  အစား아라/어라/여라 စသည်ဖြင့်ပြောင်းလဲသုံးစွဲနိုင်ပါသည်။",
        "examples": "네 옷 빨래를 네가 해라.\n(You wash your clothes.)\n(နင့်အဝတ်ကိုနင်လျှော်ပါ။)\n\n요즘 뭘 하고 있니?\n(What are you doing now.)\n(ခုတစ်လောဘာတေလုပ်နေလဲ။)\n\n처수야 졸업을 축하한다.\n(Chaw Su, congratulations on your graduation.)\n(ချောစုရေ ဘွဲ့ရတာကိုဂုဏ်ယူပါတယ်။)"
    },
    {
        "title": "아/어/여 가지고",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+아/어/여 가지고)လုပ်ပြီးတော့။\n\nIt is used with an action verb to show the performance in the second clause is done by maintaining or using the content in the first clause.\n\n동사와 붙이고 앞 문장의 활동을 한후에 둣 문장에서 그활동을 사용하거나 계속 하는것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးနောက်ဝါကျရှိလှုပ်ရှားမှုသည်ရှေ့ဝါကျမှလှုပ်ရှားမှုများကိုအသုံးပြု၍ဖြစ်စေ၊ဆက်လက်လုပ်ဆောင်၍ဖြစ်စေ လုပ်ဆောင်သည့်သဘောကိုဖော်ပြရာတွင်အသုံးပြုသည်။မြန်မာစကားတွင် \"ဒါလုပ်ပြီးတော့ဒါလုပ်လိုက်တယ်\"စသည်ဖြင့်အဓိပ္ပာယ်ရပါသည်။",
        "examples": "한국어를 배워 가지고 한구 문학책들을 번역하려고 합니다.\n(I am going to translate Korean literature books after learning Korean.)\n(ကိုရီးယားဘာသာကိုသင်ယူပြီးကိုရီးယားစာပေတွေကိုဘာသာပြန်မယ်လို့ရည်ရွယ်ထားပါတယ်။)\n\n꽃다발을 사가지고 생일 파티에 갔어요.\n(I bought a bouquet and went to birthday party.)\n(ပန်းစည်းဝယ်ပြီးတော့မွေးနေ့ပွဲသွားခဲ့တယ်။)\n\n돈을 모아가지고 노트복을 샀어요.\n(I saved money and bought a laptop.)\n(ပိုက်ဆံစုပြီးလပ်တော့ဝယ်ခဲ့တယ်။)"
    },
    {
        "title": "았/었/였 다가",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+았/었/였 다가)ရာကနေ၊ပြီးတော့။\n\nIt is used with an action verb to indicate that the speaker do the action in the second clause after the action in first clause completes.Sometime,that actions will be opposite.\n\n동사와 붙이고 앞 문장의 활동이 끝난 후 뒷 문장의 활동을 하는것을 표현할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးရှေ့ဝါကျရှိလှုပ်ရှားမှုလုံးဝပြီးမြောက်ပြီးမှ နောက်ဝါကျရှိလှုပ်ရှားမှုကိုလုပ်ဆောင်သည်ဟုဖော်ပြရာတွင်အသုံးပြုသည်။ယင်းလှုပ်ရှားမှုပြကြိယာများသည်တစ်ခါတစ်ရံဆန့်ကျင်ဖက်သဘောသက်ရောက်သည်လည်းရှိသည်။",
        "examples": "학생이 백판에서 이름을 썼다가 지웠어요.\n(Student writes his name on whiteboard and erased them.)\n(ကျောင်းသားကသူ့နာမည်ကိုဘုတ်မှာရေးပြီးတော့ဖျက်လိုက်တယ်။)\n\n창문을 열었다가 닫았어요.\n(I opened the window but I closed.)\n(တံခါးဖွင့်ထားရာကနေပိတ်လိုက်တယ်။)\n\n지갑을 잃어버렸다가 찾았어요.\n(I lost my purse but I found it.)\n(ပိုက်ဆံအိတ်ပျောက်နေရာကပြန်ရှာတွေ့ခဲ့တယ်။)"
    },
    {
        "title": "다가",
        "explainations": "(လှုပ်ရှားမှုပြကြိယာ+다가)လုပ်ရာကနေ၊လုပ်ပြီးတော့။\n\nIt is used with an action verb to show a new performance takes place without the action of the verb completed.\n\n동사와 붙이고 앞 문장의 활동이 끝나지 않고 뒷 문장의 활동을 할때 사용한다.\n\nလှုပ်ရှားမှုပြကြိယာနှင့်တွဲသုံးပြီးရှေ့ဝါကျရှိလှုပ်ရှားမှုမပြီးပြတ်သေးဘဲ လုပ်ဆောင်နေရင်း နောက်ဝါကျရှိလှုပ်ရှားမှုကိုဆက်လက်လုပ်ဆောင်သည်ဟုဖော်ပြရာတွင်အသုံးပြုသည်။",
        "examples": "책을 읽다가 전화를 받았어요.\n(I answered phone while I was reading.)\n(စာအုပ်ဖတ်ရင်း ဖုန်း​ပြန်ဖြေခဲ့တယ်။)\n\n텔레비전을 보다가 요가를 따라했어요.\n(I did yoga from watching TV.)\n(တီဗီကြည့်ရင်းယောဂလိုက်လုပ်ခဲ့တယ်။)\n\n일을 하다가 힘들어서 커피를 마셨어요.\n(I did my work and drank coffee because I was tired.)\n(အလုပ်လုပ်ရင်းနဲ့ပင်ပန်းလာလို့ကော်ဖီသောက်ခဲ့တယ်။)  "
    },
    {
        "title": "나요,은가요,ㄴ가요?",
        "explainations": "မေးဝါကျတွင်သုံးသောစကားပြောအသုံးအနှုန်း)\n(Action verb, 았/었/였, 겠, 있다/없다 +나요)\n(Quality verb +은/ㄴ 가요)\n(Noun + 인가요)\n\nIt is the speaking mood to make question.It is similar with '어요'.\n\n친한 사람들에게 물어보고 싶을때 사용하는 방식이다.\n\nစကားပြောတွင်အသုံးများသည့်မေးခွန်းပုံစံဖြစ်သည်။어요နှင့်ဆင်တူသည်။  ",
        "examples": "이 스마트폰을 어디에서 샀나요?\n(Where did you buy this smart phone.)\n(ဒီစမတ်ဖုန်းကိုဘယ်ကဝယ်ခဲ့တာလဲ။)\n\n여기와 어느 정류장이 가까운가요?\n(Which bus stop has nearby?)\n(ဒီနေရာနဲ့ဘယ်ကားမှတ်တိုင်နီးလဲ။)\n김 선생님이 어떤 사람인가요?\n(How is teacher kim?)\n(ဆရာဂင်ကဘယ်လိုလူမျိုးလဲ။)"
    }
]
